{"prototypes":{"0":[{"name":"Golden Crescent Rolls Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/4465807.jpg","description":"Dissolve yeast in warm water.**Stir in sugar, salt, eggs, butter, and 2 cups of flour. Beat until smooth. Mix in remaining flour until smooth. Scrape dough from side of bowl. Knead dough, then cover it and let rise in a warm place until double (about 1 1\/2 hours).**Punch down dough. Divide in half. Roll each half into a 12-inch circle. Spread with butter. Cut into 10 to 15 wedge. Roll up the wedges starting with the wide end. Place rolls with point under on a greased baking sheet. Cover and let rise until double (about 1 hour).**Bake at 400 degrees F (205 degrees C) for 12-15 minute or until golden brown. Brush tops with butter when they come out of the oven.**\n\nPrepare time: 25 m\nCook time: 15 m\nTotal time: 3 h 10 m","id":0},{"name":"Poppy Seed Bread with Glaze Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/34726.jpg","description":"'Preheat oven to 350 degrees F (175 degrees C). Grease bottoms of two 9-inch loaf pans.**Mix together flour, salt, baking powder, poppy seeds, butter flavoring, oil, eggs, milk, sugar, vanilla, and almond flavoring. Pour into prepared pans.**Bake at 350 degrees F (175 degrees C) for one hour. Cool 5 minutes. Poke holes in top of loaves and pour glaze over.**To make glaze: Mix orange juice, 1\/2 teaspoon butter flavoring, 1\/2 teaspoon almond flavoring, and 1 teaspoon vanilla. Add enough confectioners'' sugar to make glaze.**'\n\nPrepare time: 15 m\nCook time: 1 h\nTotal time: 1 h 20 m","id":1},{"name":"Applesauce Bread I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1024884.jpg","description":"Preheat oven to 350 degrees F (175 degrees C).  Grease and flour two 9 x 5 inch loaf pans.**Beat together eggs, sugar, and oil.  Blend in applesauce, and then sour cream or buttermilk.  Mix in flour, baking powder, soda, and cinnamon. Stir in raisins. Pour batter into prepared pans.**Bake for 80 minutes.  Cool on wire racks.**\n\nPrepare time: 10 m\nCook time: 1 h 20 m\nTotal time: 1 h 30 m","id":2},{"name":"Apple Raisin Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/21563.jpg","description":"Preheat oven to 350 degrees F (175 degrees C).  Grease and flour an 8 1\/2 x 4 1\/2 inch loaf pan.**In a large bowl, combine flour, baking powder, baking soda, salt, cinnamon, nutmeg, brown sugar, and  oats.  Add apple, nuts, raisins, eggs, milk, and oil.  Mix until dry ingredients are moistened.**Bake for 55 to 60 minutes, or until done.  Cool on wire rack.**\n\nPrepare time: 15 m\nCook time: 1 h\nTotal time: 1 h 15 m","id":3},{"name":"Buttermilk Oatmeal Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1149697.jpg","description":"Mix oats with buttermilk.  Let stand for 1\/2 hour.**Stir oil, egg, and brown sugar into oat mixture. Stir together flour, baking powder, soda, and salt: mix into oat mixture.  Pour batter into a greased and floured 8 1\/2 x 4 1\/2 inch loaf pan.**Bake at 350 degrees F (175 degrees C) for 55 to 60 minutes, or until done.**\n\nPrepare time: 10 m\nCook time: 1 h\nTotal time: 1 h 40 m","id":4},{"name":"Kolaches II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/943400.jpg","description":"Cream shortening and sugar together.  Stir in salt, hot milk, beaten egg yolks, and flavoring.  When lukewarm, add yeast to mixture.  Let stand 5 minutes.  Add flour, beating well.  Knead down into bowl.  The dough will be slightly sticky.  Let rise 1 hour.**Cut off small balls of dough.  Roll into rounds in your hands, and place on greased cookie sheets 2 inches apart.  Let rise 15 minutes.**Make a depression into the center of each roll.  Fill with fruit preserves.**Bake at 450 degrees F (230 degrees C) until brown.  Watch carefully.  Cool on wire racks.**\n\nPrepare time: 30 m\nCook time: 20 m\nTotal time: 2 h 5 m","id":5},{"name":"Whole Wheat Bread II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/5504282.jpg","description":"Dissolve brown sugar in 1 cup hot water.  Add shortening, and stir to melt.  Let cool.**In a large bowl, dissolve yeast in 4 cups warm water.  Add white sugar, salt, and bread flour.  Beat well.  Stir in shortening mixture.  Stir in enough whole wheat flour to make a stiff but not dry dough.**Turn out onto a lightly floured surface.  Knead until smooth and elastic.  Place in a large, well oiled bowl.  Cover, and allow to rise until dough doubles in bulk.**Divide dough into four equal parts.  Shape into loaves.  Place in greased, 9 x 5 inch pans,  turning each loaf over in pan to grease top.  Allow to rise until dough doubles in bulk.**Bake at 350 degrees F (175 degrees C) for 35 minutes. Let cool before slicing.**\n\nPrepare time: 20 m\nCook time: 35 m\nTotal time: 2 h 25 m","id":6},{"name":"Cottage Cheese Bread II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3129162.jpg","description":"Add the ingredients to the pan of your bread machine in the order suggested by the manufacturer, and Start. You can use more bread flour if the dough seems too sticky.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":7},{"name":"Mocha Chocolate Chip Banana Muffins Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1334257.jpg","description":"Preheat oven to 350 degrees F (175 degrees C).**Blend butter or margarine, sugar, egg, banana, dissolved coffee, and vanilla in food processor for 2 minutes. Add flour, salt, baking powder, and soda, and blend just until flour disappears. Add chocolate chips and mix in with wooden spoon. Spoon mixture into 15 to 18 paper-lined muffin cups.**Bake for 25 minutes.  Cool on wire racks.**\n\nPrepare time: 10 m\nCook time: 25 m\nTotal time: 35 m","id":8},{"name":"'Ruby''s Special Cornbread Recipe '","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/51489.jpg","description":"Preheat oven to 350 degrees F (175 degrees C).**Combine the cornmeal, milk, oil, eggs, chopped green bell pepper, chopped onion, garlic powder, salt, baking soda, sugar, drained corn kernels, pimentos and jalapeno peppers.  Mix until combined, and pour into a well greased 10 to 14 inch cast iron skillet.**Bake for 45 minutes.**\n\nPrepare time: 10 m\nCook time: 45 m\nTotal time: 55 m","id":9},{"name":"Maple Muffins Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/6097687.jpg","description":"Preheat oven to 400 degrees F (205 degrees C).  Grease the cups of a 12-cup muffin pan.**Sift together flour, sugar, baking powder and salt.   Cut in shortening until mixture resembles coarse crumbs.  Stir in oats.  Add egg, milk, and syrup.  Stir only until dry ingredients are moistened.  Fill greased muffin tins 3\/4 full.**Bake for 18 to 20 minutes.  Remove from oven, and let stand a few minutes before removing muffins from the pan.**\n\nPrepare time: 10 m\nCook time: 20 m\nTotal time: 30 m","id":10},{"name":"French Toast I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/234562.jpg","description":"Beat together egg, milk, salt, desired spices and vanilla.**Heat a lightly oiled griddle or skillet over medium-high heat.**Dunk each slice of bread in egg mixture, soaking both sides.  Place in pan, and cook on both sides until golden.  Serve hot.**\n\nPrepare time: 5 m\nCook time: 15 m\nTotal time: 20 m","id":11},{"name":"Angel Biscuits II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/45561.jpg","description":"In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 5 minutes. Add buttermilk to yeast mixture, and set aside.**In a large bowl, combine flour, sugar, baking powder, baking soda, and salt. Cut in shortening with a pastry blender until mixture resembles coarse meal. Stir in yeast mixture until dry ingredients are moistened. Turn dough out onto a floured surface, and knead 4 or 5 times.**On a lightly floured surface, roll dough to 1\/2 inch thickness. Cut out biscuits with a 2 1\/2 inch round cutter. Place on lightly greased baking sheets, barely touching each other. Cover, and let rise in a warm place free from drafts for 1 hour, or until almost doubled in size. Preheat oven to 425 degrees F (220 degrees C).**Bake in preheated oven for 10 to 12 minutes, or until browned.**\n\nPrepare time: 35 m\nCook time: 10 m\nTotal time: 1 h 45 m","id":12},{"name":"Fudgy Chocolate Chip Muffins Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/4467940.jpg","description":"'Preheat oven to 350 degrees F (175 degrees C). Line muffin cups (2-1\/2 inches in diameter) with paper bake cups.**In large mixer bowl, beat butter, sugar, brown sugar, egg, and vanilla until well blended. Add applesauce, blend well.**In a separate bowl, stir together flour, cocoa, baking soda, and cinnamon, if desired. Add to butter mixture, blending well. Stir in chocolate chips. Fill muffin cups 3\/4 full with batter.**Bake at 350 degrees F (175 degrees C) for 22 to 26 minutes or until wooden pick inserted in center comes out almost clean. Cool slightly in pan on wire rack. Sprinkle muffin tops with confectioners'' sugar, if desired. Serve warm.**'\n\nPrepare time: 10 m\nCook time: 25 m\nTotal time: 35 m","id":13},{"name":"Pumpernickel Bread II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/798353.jpg","description":"Mix well bread flour, rye flour, cornmeal, salt, yeast, cocoa, and brown sugar. Add milk, oil, and molasses. Mix thoroughly. When mixed well enough that the dough holds together, knead by hand 15-20 minutes.**Cover, let rise in bowl 30 minutes. Punch down, form, and place into 9 1\/2x5 inch pan. Cover with damp cloth and let rise about 1 hour.**Bake in preheated 375 degree F (190 degrees C) oven 25 to 30 minutes, covering top with aluminum foil last 10 minutes.**\n\nPrepare time: 30 m\nCook time: 1 h\nTotal time: 2 h 30 m","id":14},{"name":"Indian Naan II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/96729.jpg","description":"Whisk the warm water with the yeast and sugar until the yeast is dissolved. Cover and let stand in a warm place for 10 minutes.**Sift flour and salt three times into a large bowl add the yeast mixture, half of the ghee and all the yogurt. Mix into a soft dough then knead on a floured surface for about 5 minutes or until dough is smooth and elastic. Place the dough in a large greased bowl, cover and let stand in a warm place for 1 1\/2 hours or until the dough is doubled in size .**Punch down dough then knead for 5 minutes. Divide dough into 6 pieces. Roll each piece out into 8 inch round naans.**Cover an oven tray with foil and grease the foil. Brush the naan with a little of the remaining ghee and sprinkle with some of the kalonji. Cook naan one at a time under the broiler for about 2 minutes on each side or until puffed and just browned.**\n\nPrepare time: 25 m\nCook time: 20 m\nTotal time: 2 h 25 m","id":15},{"name":"Lefse II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/996053.jpg","description":"In a large bowl, mix by hand sour milk or buttermilk, corn syrup, sugar, soda, cardamom, and flour until mixture becomes a soft pliable dough.**Divide the dough into 12 or so pieces. Roll out each piece until about 1\/8 inch thick.**Bake on a lightly floured griddle over very low heat for 12 to 15 minutes per side. Serve warm with your favorite cheese or jam.**\n\nPrepare time: 15 m\nCook time: 45 m\nTotal time: 1 h","id":16},{"name":"Banana Nut Bread Baked in a Jar Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/5110.jpg","description":"'Preheat oven to 325 degrees F (165 degrees C). Grease insides of  8 (1 pint) straight sided, wide mouth canning jars.**In a large bowl, cream shortening and sugar until light and fluffy. Beat in eggs, bananas, and water. Sift together flour, baking powder, soda, salt, cinnamon, and cloves. Add to banana mixture. Stir in nuts.**Pour mixture into greased  WIDE MOUTH pint jars, filling 1\/2 full of batter. Do NOT put lids on jars for baking. Be careful to keep the rims clean, wiping off any batter that gets on the rims.**Bake at 325 degrees F (165 degrees C) for 45 minutes. Meanwhile, sterilize the lids and rings in boiling water.**As soon as cake is done, remove from oven one at a time, wipe rims of jars and put on lid and ring. Jars will seal as cakes cool. Place the jars on the counter and listen for them to \"ping\" as they seal. If you miss the \"ping\", wait until they are completely cool and press on the top of the lid. If it doesn''t move at all, it''s sealed.**Jars should be eaten immediately or kept sealed in refrigerator for up to a week.**'\n\nPrepare time: 10 m\nCook time: 45 m\nTotal time: 1 h 5 m","id":17},{"name":"Light Oat Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/257322.jpg","description":"Add ingredients to bread machine pan in order recommended by your manufacturer. Use regular light setting.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":18},{"name":"Honey Oatmeal Bread I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/506180.jpg","description":"Place ingredients in the bread machine pan in the order suggested by the manufacturer. Select the multigrain setting, and press start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":19},{"name":"Oatmeal Soda Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/4465760.jpg","description":"Preheat oven to 375 degrees F (190 degrees C).**In a large bowl, mix together flour, 1\/2 cup oats, salt, baking powder, and baking soda.**In another bowl, mix together sour cream, milk, honey, and sugar.  Add to the flour mixture, and mix just until well blended.  Stir in melted butter or margarine.**Turn dough onto a lightly sprayed baking sheet.  Shape into a round, lightly mounded circle, about 8 inches diameter.  Brush the top of the loaf with melted butter or margarine, and sprinkle with remaining 1 tablespoon oats.  With a knife, score the top of the loaf into quarters.**Bake for about 40 minutes, or until browned.  Cool completely before slicing.**\n\nPrepare time: 10 m\nCook time: 40 m\nTotal time: 50 m","id":20},{"name":"'Mary Anne''s Moist and Nutty Carrot Loaf Recipe '","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/2014006.jpg","description":"Preheat oven to 375 degrees F (190 degrees C).  Grease and flour two 9x5 inch loaf pans.**Sift together baking soda, salt, spices, and flour.**In a large bowl, combine ground carrots, pineapple, oil, and sugar.  Mix in eggs.  Blend flour mixture into carrot mixture.  Mix well.  Fold nuts and raisins into batter.  Pour into prepared  pans.**Bake at 375 degrees F (190 degrees C)for 45 minutes, or until a toothpick inserted into bread comes out clean.**\n\nPrepare time: 15 m\nCook time: 45 m\nTotal time: 1 h","id":21},{"name":"Russian Black Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/36112.jpg","description":"Place ingredients into the bread machine in order suggested by the manufacturer.**Use the whole wheat, regular crust setting.**After the baking cycle ends, remove bread from pan, place on a cake rack, and allow to cool for 1 hour before slicing.**\n\nPrepare time: 15 m\nCook time: 3 h\nTotal time: 3 h 15 m","id":22},{"name":"Basic Fruit Bread Recipe Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/535516.jpg","description":"Preheat oven to 350 degrees F (175 degrees C). Grease one 4 1\/2 x 8 1\/2 inch loaf pan.**Mix flour, baking powder, soda, salt, sugar, oil, eggs, apple, walnuts, and vanilla only until dry ingredients are moistened.**Bake in greased 4 1\/2 x 8 1\/2 inch loaf pan at 350 degrees F (175 degrees C) for 35 to 40 minutes.**\n\nPrepare time: 10 m\nCook time: 40 m\nTotal time: 50 m","id":23},{"name":"Angel Biscuit Rolls Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/184711.jpg","description":"Dissolve yeast in warm water.**Sift together flour, sugar, soda, baking powder, and salt. Add buttermilk and dissolved yeast. Add shortening and stir. Store dough, covered, in the fridge until ready to use.**Roll out on a lightly floured surface or shape into balls--these do not need to rise. Brush tops of biscuits with melted butter.**Bake at 400 degrees F (205 degrees C) for 15-20 minutes.**\n\nPrepare time: 10 m\nCook time: 20 m\nTotal time: 30 m","id":24},{"name":"Panettone II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/278215.jpg","description":"Place all of the ingredients except for the mixed fruit into the pan of your bread machine in order directed by manufacturer. Select Sweet or Basic\/White bread cycle, and use the Medium or Light crust color. Do not use the delay cycles. Add the fruit 5 to 10 minutes before the last kneading cycle ends, or when the raisin or nut signal starts.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":25},{"name":"'J.P.''s Big Daddy Biscuits Recipe '","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/4512167.jpg","description":"Preheat oven to 425 degrees F (220 degrees C).**In a large bowl, whisk together the flour, baking powder, salt, and sugar. Cut in the shortening until the mixture resembles coarse meal. Gradually stir in milk until dough pulls away from the side of the bowl.**Turn out onto a floured surface, and knead 15 to 20 times. Pat or roll dough out to 1 inch thick. Cut biscuits with a large cutter or juice glass dipped in flour. Repeat until all dough is used. Brush off the excess flour, and place biscuits onto an ungreased baking sheet.**Bake for 13 to 15 minutes in the preheated oven, or until edges begin to brown.**\n\nPrepare time: 30 m\nCook time: 15 m\nTotal time: 45 m","id":26},{"name":"Bread Machine Challah I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/43320.jpg","description":"Add ingredients to the pan of the bread machine in the order suggested by the manufacturer.**Select Basic Bread and Light Crust settings. Start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":27},{"name":"Oatmeal Molasses Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1081599.jpg","description":"Place ingredients in the pan of the bread machine in the order suggested by the manufacturer.**Select White Bread setting, and Start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":28},{"name":"Zucchini Pineapple Bread I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1326500.jpg","description":"Combine flour, baking powder, baking soda, and salt.**In a large bowl, mix oil, eggs, vanilla, sugar, cinnamon, and nutmeg.  Blend in pineapple and zucchini.  Stir flour mixture into zucchini mixture.  Pour batter into two greased and floured 9 x 5 inch loaf pans.**Bake at 350 degrees F (175 degrees C) for 1 hour.  Cool on wire racks.**\n\nPrepare time: 20 m\nCook time: 1 h\nTotal time: 1 h 20 m","id":29},{"name":"Pumpkin Swirl Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/835912.jpg","description":"Blend cream cheese, 1\/4 cup sugar, and 1 beaten egg.  Set aside.**Combine flour, 1 1\/2 cups white sugar, baking soda, salt, and spices.  Set aside.**Combine pumpkin, butter or margarine, beaten egg, and water.  Add flour mixture to pumpkin mixture, mixing just until moistened.  Reserve 2 cups of the pumpkin batter.  Pour the remaining batter into a greased and floured  9 x 5 inch loaf pan.  Pour cream cheese mixture over pumpkin batter, and top with reserved pumpkin batter.  Cut through batter several times with a knife for a swirl effect.**Bake at 350 degrees F (175 degrees C) for 70 minutes, or until tester comes out clean.  Cool in the pan for 10 minutes, and then remove from pan to cool completely.**\n\nPrepare time: 15 m\nCook time: 1 h 10 m\nTotal time: 1 h 35 m","id":30},{"name":"Jule Kaka Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/290169.jpg","description":"Dissolve yeast in water.**Scald milk, and add melted butter or margarine, salt, sugar.  When lukewarm add to yeast and water.  Stir in 4 cups flour.  Cover, and place in a warm place.  Let rise for about 2 hours, or till doubled in bulk.**Punch down.  Stir in cardamom, cherries, raisins and citron.  Work in remaining flour until soft dough forms.  Let rise in warm place for 2 to 3 hours, or until doubled.**Knead slightly, and form into 4 round loaves.  Place on greased cookie sheets.  Let rise for 1 to 2 hours, or till doubled.  Brush loaves with beaten egg white.**Bake at 350 degrees F (175 degrees C) for 30 to 40 minutes, or until golden brown.**\n\nPrepare time: 20 m\nCook time: 40 m\nTotal time: 6 h","id":31},{"name":"'Steve''s Whole Wheat Recipe '","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1812319.jpg","description":"Place the ingredients in the pan of the bread machine in the order recommended by the manufacturer.  Select Whole Wheat setting, and Start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":32},{"name":"Oatmeal Bread II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/57347.jpg","description":"Place ingredients in the pan of the bread machine in the order recommended by the manufacturer.  Select White Bread setting, and Start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":33},{"name":"Coconut Pumpkin Nut Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/510657.jpg","description":"Preheat oven to 350 degrees F (175 degrees C).  Grease and flour two 8 x 4 inch loaf pans.**Combine flour, sugars, pumpkin, oil, coconut milk, baking soda, salt, and spices.  Mix until well blended.  Fold in coconut and nuts.  Pour into prepared pans.**Bake for about 1 hour and 15 minutes, or until an inserted toothpick comes out clean.  Remove from oven.  Cover with foil tightly, and allow to steam 10 minutes.  Remove foil, and turn out onto cooling rack.  Tent lightly with the foil, and allow to cool completely.**\n\nPrepare time: 10 m\nCook time: 1 h 15 m\nTotal time: 1 h 35 m","id":34},{"name":"Dizzy Pineapple Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/407035.jpg","description":"Preheat oven to 350 degrees F (175 degrees C). Grease one 9x5 inch baking pan.**Combine the pineapple flour, sugar and beer. Do not overmix! Pour batter into the prepared pan.**Bake at 350 degrees F (175 degrees C) for about 1 hour or until bread tests done.**\n\nPrepare time: 5 m\nCook time: 1 h\nTotal time: 1 h 5 m","id":35},{"name":"European Black Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/698.jpg","description":"Place the ingredients in the pan of the bread machine in the order suggested by the manufacturer. Select Normal setting, and then press Start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":36},{"name":"Chili Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1009074.jpg","description":"Place the ingredients in the pan of the bread machine in the order suggested by the manufacturer.  Select the French Bread or White Bread setting, and then press Start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":37},{"name":"Whole Wheat Honey Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/19436.jpg","description":"Place ingredients in bread machine pan in the order suggested by the manufacturer. Select Whole Wheat setting, and then press Start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":38},{"name":"Carrot Thyme Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/246728.jpg","description":"Place the  ingredients in the bread machine pan in the order suggested by the manufacturer.  Select Basic Bread setting, and then press Start.**Allow the loaf to cool before slicing.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":39},{"name":"Golly Gee Gluten","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/5187091.jpg","description":"In a medium mixing bowl, beat the egg with the apple juice and melted butter. Add the remaining ingredients and stir.**Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1\/4 cup for each pancake. Brown on both sides and serve hot. This batter must be used right away and can not sit and wait.**\n\nPrepare time: 10 m\nCook time: 15 m\nTotal time: 25 m","id":40},{"name":"Amish Cinnamon Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/19056.jpg","description":"Preheat oven to 325 degrees F (165 degrees C). Grease three 9x5 inch loaf pans.**Place the starter in a bowl, stir in the oil, sugar, eggs and vanilla and mix well.**Combine the flour, baking soda, baking powder, instant pudding, and cinnamon. Add the flour mixture to the starter mixture and beat by hand. Add the pecans, raisins  and apples and mix well. Pour batter into the prepared pans.**Bake at 325 degrees F (165 degrees C) for 1 hour.**\n\nPrepare time: 10 m\nCook time: 1 h\nTotal time: 1 h 10 m","id":41},{"name":"French Herb Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/542031.jpg","description":"In a large bowl combine the yeast, sugar, 1 teaspoon of the salt and 1 1\/2 cups of the flour.**In a sauce pan combine the milk, water and 1\/4 cup of the butter or margarine until 110 degrees F (38 degrees C). Add milk mixture and vinegar to the flour mixture and blend at low speed of the mixer until moistened. Beat at medium speed for 3 minutes.**Stir in 1 1\/2 cups additional flour to form a sticky dough. Turn dough out onto a floured surface and knead adding 1\/2  to 1 cup more of flour until dough is smooth and pliable. Place dough in a greased bowl and let rise in a warm place until doubled in volume.**Punch down dough and roll into a rectangle shape about 16x8 inches.**In a saucepan heat the onion, garlic, 1\/2 teaspoon salt, parsley and 2 tablespoons butter or margarine until butter or margarine is melted. Spread over the dough rectangle and starting from the 16 inch side roll the dough up tightly like a jelly roll.**Place the bread seam side down onto a greased cookie sheet and let rise until doubled in sized.**Preheat oven to 400 degrees F (205 degrees C).**Bake bread until golden brown about 20 to 30 minutes. Brush hot bread with melted butter and sprinkle with chopped parsley.**\n\nPrepare time: 30 m\nCook time: 30 m\nTotal time: 2 h 40 m","id":42},{"name":"Easy Rice Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1202095.jpg","description":"To help insure success have all ingredients at room temperature before proceeding. Combine the white rice flour, brown rice flour, xanthan gum, and salt. Mix very well. The flours need to be completely combined.**Combine the gelatin, sugar, egg replacer, milk powder, beaten eggs, vinegar and oil. Beat until well combined.**Combine the flour mixture, egg mixture and yeast together and beat well. A standup mixture works best for this. Add tepid water to dough if mixture is to dry. The dough should be somewhere between a normal bread dough consistency and a batter.**Pour into greased 9x5 inch bread pan and allow to rise in a warm, still place until doubled in bulk. Bake in a preheated oven at 325 degrees F (165 degrees C)  until crust is a light to medium brown. Cool ten minutes in the pan, then to room temperature outside the pan before slicing.**\n\nPrepare time: 20 m\nCook time: 1 h\nTotal time: 2 h 50 m","id":43},{"name":"Lemon Poppy Seed Muffins I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1618431.jpg","description":"Preheat oven to 400 degrees F (205 degrees C). Lightly grease a muffin tin.**Combine the flour, 3\/4 cup white sugar, poppy seeds, baking powder, baking soda and salt.**In a separate bowl mix the eggs, yogurt, vegetable oil and lemon zest. Blend well and pour over the flour mixture. Mix until just combined. Do no overmix!**Spoon batter evenly between the prepared muffin cups. Bake at 400 degrees F (205 degrees C) for 20 minutes.**Combine the lemon juice with the remaining 3 tablespoons white sugar. Stir into sugar dissolves.**Once the muffins are baked pierce the tops several times with a toothpick. Slowly pour about 1 tablespoon of the lemon juice and sugar mixture over the tops of each muffin. Let muffins cool in pans for 10 minutes before removing them from the tin.**\n\nPrepare time: 20 m\nCook time: 20 m\nTotal time: 40 m","id":44},{"name":"Lemon Poppy Seed Muffins II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/90970.jpg","description":"'Preheat oven to 400 degrees F (205 degrees C). Grease the bottoms only of 12 muffin cups.**Beat the milk, oil, lemon yogurt and egg together. Stir in the flour, white sugar, poppy seeds, lemon zest, lemon oil, baking powder, baking soda and salt. Mix until just combined. Divide batter evenly between muffin cups.**Bake at 400 degrees F (205 degrees C). For 16 to 18 minutes or until golden brown. Drizzle with glaze immediately and let cool on rocks.**To Make Glaze: Stir the confectioners'' sugar with the lemon juice and mix until smooth and of drizzling consistency. Add drops of milk if thinning is necessary.**'\n\nPrepare time: 13 m\nCook time: 17 m\nTotal time: 30 m","id":45},{"name":"Special Banana Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/17407.jpg","description":"Preheat oven to 350 degrees F (175 degrees C). Spray two 9x5 inch loaf pans with non-stick cooking spray.**Cream the shortening and sugar until light. Beat in the eggs one at a time.**Sift together the flour, salt, baking soda, cinnamon, cloves, and nutmeg. Add to the shortening mixture and mix to combine.**Thoroughly mash the bananas. Stir bananas into the batter then stir in the walnuts. Pour the batter into the prepared pans.**Bake at 350 degrees F (175 degrees C) for 45 minutes to 1 hour or until a wooden skewer inserted near the center comes out clean. Check with a wooden skewer every 15 minutes after 45 minutes of baking. It can take up to 65 to 70 minutes to cook.**\n\nPrepare time: 10 m\nCook time: 1 h\nTotal time: 1 h 10 m","id":46},{"name":"Injera Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/651532.jpg","description":"Dissolve yeast and honey in 1\/4 cup of the water. Allow to proof and add the remainder of the water and the millet flour. Stir until smooth and then cover. Allow to stand at room temperature for 24 hours.**Stir the batter well and mix in the baking soda.**Heat a large non-stick skillet over medium heat. Pour about 1\/3 cup of the batter into the pan in a spiral pattern to cover the bottom of the pan evenly. Tilt the pan to quickly even out the batter. Cover the pan and allow to cook for about 1 minute. The bread should not brown but rather rise slightly and very easy to remove. It is cooked only on one side. This top should be slightly moist. Remove to a platter and cool. Stack the cooked breads on a plate.**\n\nPrepare time: 10 m\nCook time: 10 m\nTotal time: 1 d 20 m","id":47},{"name":"Pita Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3346005.jpg","description":"'Dissolve the yeast and sugar in the warm water.**Combine the all-purpose flour, pastry flour and salt in a bowl. Stir in the yeast mixture and applesauce and knead. Dough shouldn''t be sticky, but it shouldn''t be dry either. If too sticky add 1 tablespoon of all-purpose flour till you get the right consistency. If too dry, add 1 tablespoons of water at a time till you get the right consistency.**Roll out into a rope and cut into 8 pieces. Shape each piece into a ball and roll out till it''s anywhere from a 6 to 8 inch circle**There are two ways to cook pita bread. The flavor is a bit different with both.   To Bake Pita:  Preheat oven to 500 degrees F (260 degrees C) and put a pita on a wire cake rack. Toss in the rack and cook for 3 minutes or until the bread stops puffing up. When you take it out, smash down the pita (Careful, its hot!) and quickly put it in a plastic freezer bag.  To Fry Pita:  Heat olive oil in a skillet over high heat. When almost smoking, place a pita in the pan and cook for a few minutes on each side, till brown spots begin to appear. It should look something like a tortilla when you''re done. Put in a plastic bag once it has cooled a bit.**'\n\nPrepare time: 30 m\nCook time: 20 m\nTotal time: 50 m","id":48},{"name":"Raisin Bread II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/59232.jpg","description":"Place ingredients in the bread machine pan in the order suggested by the manufacture**Select the Basic or White Bread setting. There is no need to select Fruit Bread setting, nor to add the raisins in later. Start the machine. After first knead, bread should be smooth, elastic, and dry to touch. Adjust if necessary with additional flour.**After baking, remove pan immediately. Rest for 10 minutes in the pan. Remove bread from the pan, and cool on a wire rack for 10 minutes before serving.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 15 m","id":49},{"name":"Hot Cross Buns II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/207097.jpg","description":"In a small bowl, sprinkle the yeast over half the warm milk. Let stand until creamy, about 15 minutes.**In another bowl, mix two eggs and butter into the remaining warm milk.**Place the whole wheat flour in a mixing bowl and add the salt, nutmeg, currants, and candied citrus peel. Make a well in the center and put in the yeast mixture, butter and egg mixture, and honey. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.**Lightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour. Meanwhile, make the crosses for the buns: Mix together 1 cup flour and 1\/2 cup shortening to make a pastry. Roll out the pastry and cut in thin strips, set aside.**Deflate the dough and turn it out onto a lightly floured surface. Divide into 16 equal pieces and form into round buns. Place them on lightly greased baking sheets**Hanging the prepared strips of dough over the buns loosely so that they touch the baking sheets on each side. This allows for the expansion of the buns. Preheat oven to 400 degrees F (200 degrees C).**Beat together one egg and 1\/4 cup plus 2 tablespoons milk. Brush the buns with this mixture and leave them in a warm place for 20 minutes to rise.**Place a tray of hot water in the bottom of the oven to make it steamy. This gives the buns a thin, soft crust. Bake the buns at 400 degrees F (200 degrees C)  for 20 minutes, or until they are golden-brown. Cool them on wire racks and serve them split and buttered.**\n\nPrepare time: 40 m\nCook time: 20 m\nTotal time: 2 h 30 m","id":50},{"name":"Plain and Simple Sourdough Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/649351.jpg","description":"Add all ingredients in order suggested by your manufacturer.**Select white bread setting and push start.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":51},{"name":"Garlic and Herb Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/4557638.jpg","description":"For bread machine: Place all ingredients in bread pan as recommended by your manufacturer. Process on \"Regular\" or \"White Bread\" cycle. Remove promptly after baking cycle is complete.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":52},{"name":"'Ron''s Fruit Bread Recipe '","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/284886.jpg","description":"Place ingredients in order suggested by your manufacturer.**Select sweet bread setting. Add the raisins and mixed peel when the machine beeps, or 5 minutes before kneading is complete.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":53},{"name":"'Ron''s Bread Machine White Recipe '","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/910644.jpg","description":"Place ingredients in order suggested by your manufacturer.**Select basic bread setting, normal crust.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":54},{"name":"Portuguese Sweet Bread I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/2485663.jpg","description":"Add ingredients in order suggested by your manufacturer.**Select \"sweet bread\" setting.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":55},{"name":"Pizza Crust I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/16574.jpg","description":"Add ingredients in the order suggested by your manufacturer. Set bread-maker for dough setting and start machine. When the unit signals, remove dough.**Pat dough into 12x15-inch jelly roll pan or greased 12-inch round pizza pan. Let stand 10 minutes. Preheat oven to 400 degrees F (205 degrees C). Spread pizza sauce over dough. Sprinkle toppings over sauce. Bake 15-20 minutes, or until crust is golden brown.**\n\nPrepare time: 10 m\nCook time: 20 m\nTotal time: 2 h 40 m","id":56},{"name":"Tomato Basil Sherry Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/16277.jpg","description":"'Place all ingredients in the bread machine in order suggested by your manufacturer (except for the sun dried tomatoes).**Select regular setting, medium crust. At the beep or according to your manufacturer''s suggestion add the sun dried tomatoes.**Remove immediately at end of baking cycle. Let cool and slice, spread with your favorite topping.**'\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":57},{"name":"Onion, Garlic, Cheese Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/964906.jpg","description":"Add water, flour, powdered milk, sugar, salt, butter or margarine and yeast into bread machine in the order suggested by your manufacturer. Set for basic cycle with the light crust.**When alert sound or when indicated by your manufacturer add the garlic powder, 2 tablespoons of the onion flakes and all of the shredded cheese. After the last knead sprinkle the remaining tablespoon of onion flakes over dough.**Enjoy hot and fresh bread.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":58},{"name":"Irish Soda Bread III Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/4464983.jpg","description":"Add ingredients in order suggested by your manufacturer. Select fruit bread or basic bread setting. Add raisins when indicated by your manufacturer.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":59},{"name":"The All","image":"https:\/\/images.media-allrecipes.com\/images\/79591.png","description":"Add ingredients in order suggested by your manufacturer. Select whole wheat setting.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":60},{"name":"Sourdough Wheat Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1454058.jpg","description":"Add ingredients in order suggested by your manufacturer. Select whole wheat setting.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":61},{"name":"Basic British Scones Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/661754.jpg","description":"Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.**Sift the flour, cream of tartar, baking soda and salt into a bowl.**Rub in the butter until the mixture resembles fine breadcrumbs. Stir in the sugar and enough milk to mix to a soft dough.**Turn onto a floured surface, knead lightly and roll out to a 3\/4-inch thickness. Cut into 2-inch rounds and place on the prepared baking sheet. Brush with milk to glaze.**Bake at 425 degrees F (220 degrees C) for 10 minutes then cool on a wire rack. Serve with butter or clotted cream and jam.**\n\nPrepare time: 15 m\nCook time: 10 m\nTotal time: 25 m","id":62},{"name":"Yeast","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1263480.jpg","description":"Preheat oven to 350 degrees F (175 degrees C). Grease one 9x5 inch loaf pan.**Combine the flour, sugar and carbonated beverage. Mix well and place into the prepared pan.**Bake at 350 degrees F (175 degrees C) for 45 minutes. Note: If using a sweetened carbonated beverage cut back on the sugar a little.**\n\nPrepare time: 5 m\nCook time: 45 m\nTotal time: 50 m","id":63},{"name":"Bread Bowls II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/62348.jpg","description":"Thaw bread dough.**Preheat oven to 375 degrees F (190 degrees C).**Divide bread dough into fourths. Roll each fourth into an 8 inch circle.**Brush the back of 4 oven-safe bowls with oil or cooking spray. Place bowls upside down on a baking sheet. Place dough circles on bowls. Brush edge of dough with water and fold it back into a \"hem\" to make a bowl rim.**Bake at 375 degrees F (190 degrees C) for 18 to 20 minutes.**\n\nPrepare time: 10 m\nCook time: 20 m\nTotal time: 13 h 20 m","id":64},{"name":"Bread Sticks Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1061167.jpg","description":"Lightly grease one large baking sheet.**Divide each roll in half. Roll dough between hands to make a 4-inch long stick. Place sticks on the prepared baking sheet. Brush lightly with egg white or melted butter or margarine. Sprinkle with garlic salt. Sprinkle with parmesan cheese or sesame seeds. Cover and allow to rise until doubled in size, about 30 minutes.**Bake in a preheated 350 degrees F (175 degrees C) oven for 12 minutes or until golden brown. Do not overbake as these burn easily on the bottom.**\n\nPrepare time: 15 m\nCook time: 12 m\nTotal time: 57 m","id":65},{"name":"Banana Macadamia Nut Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3478894.jpg","description":"Place ingredient in bread machine in order suggested by your manufacturer. Select sweet bread setting and light crust. Add macadamia nuts when indicated by your manufacturer.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":66},{"name":"Cinnamon Bread II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/401424.jpg","description":"Place ingredients in order suggested by your manufacturer. Select the sweet bread and light crust settings. Add raisins when indicated by your manufacturer.**\n\nPrepare time: 5 m\nCook time: 3 h\nTotal time: 3 h 5 m","id":67},{"name":"Homemade Wonderful Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/27759.jpg","description":"Whisk together the yeast, 1\/4 cup warm water and sugar. Allow to sit for 15 minutes.**Add ingredients in the order suggested by your manufacturer, including the yeast mixture. Select the basic and light crust setting.**\n\nPrepare time: 10 m\nCook time: 3 h\nTotal time: 3 h 25 m","id":68},{"name":"Spudnuts Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/2082932.jpg","description":"In a small saucepan, cover peeled potatoes with water. Bring water to a boil and cook until tender, about 15 minutes. Let cool and mash.**Scald the milk and add the sugar, shortening, 2 cups mashed potatoes and salt. Mix well.**In an upright mixer with a dough hook attachment. Add the potato mixture, flour, lemon juice, lemon zest, water, yeast eggs and nutmeg. Mix until well mixed, dough will be a bit sticky. Cover and let rise until doubled in size.**Roll dough out on a lightly floured surface and cut with a doughnut cutter. Place the cut doughnuts on a greased baking sheet, cover and let rise until doubled in size.**In a hot fryer or deep fry pan heat shortening or canola oil to 375 degrees F (190 degrees C). Carefully place 2 to 3 doughnuts in pan. Turn when lightly golden. Lift out when done and drain on paper towels. Glaze or roll in sugar.**\n\nPrepare time: 20 m\nCook time: 20 m\nTotal time: 1 h 40 m","id":69},{"name":"Irresistible Irish Soda Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1111853.jpg","description":"Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5 inch loaf pan.**Combine flour, baking powder, sugar, salt and baking soda. Blend egg and buttermilk together, and add all at once to the flour mixture. Mix just until moistened. Stir in butter. Pour into prepared pan.**Bake for 65 to 70 minutes, or until a toothpick inserted in the bread comes out clean. Cool on a wire rack. Wrap in foil for several hours, or overnight, for best flavor.**\n\nPrepare time: 15 m\nCook time: 1 h 10 m\nTotal time: 1 h 25 m","id":70},{"name":"Christmas Stollen II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/523523.jpg","description":"'Place the fruit in a bowl with the rum, and soak for at least 1 hour.  Sprinkle 1 1\/2 tablespoons flour into the fruit, together with the almonds.  Stir until the flour is completely absorbed.**In a small bowl, stir the yeast and 1 teaspoon sugar into the water.  Let stand for 15 minutes.**Warm the milk until it is lukewarm, and stir in the remaining sugar until it has dissolved.  Stir in the almond extract and lemon rind.**Place all but 1\/4 cup of the flour in a large bowl with the salt, and make a well in the center.  Pour in the yeast mixture, and stir in a little of the flour from the edge of the well.  Add egg and the milk and sugar mixture.  Beat in softened butter.  Mix together to form a dough.**Turn dough onto a floured work surface.  Knead, using the rest of the flour, for 15 minutes, or until  no longer sticky.  Knead in fruit and almonds.  Clean and dry the bowl, and brush the inside with 1 tablespoon melted butter.  Brush the top of the dough with another 2 teaspoons melted butter or margarine, and place it in the bowl.  Cover the dough with a clean cloth.  Let rise for 2 hours, or until  doubled in size.**Punch down the dough, and let it rest for 10 minutes.  Roll it out into a 8 x 12 inch rectangle.  Brush with remaining melted butter or margarine.  Bring one long side across it, overlapping it in place with seam by about 1 inch.  Press the edge gently to keep it in place.  With floured hands, taper the ends of the loaf slightly and push the sides gently together to mound it in the center.  The finished loaf should be about 3 1\/2 inches wide and 14 inches long.  Place the loaf on a floured baking sheet, and brush it with any remaining melted butter or margarine.  Leave it in a warm place for 1 hour, or until  doubled in size.**Bake at 375 degrees F (190 degrees C) for 45 minutes, or until golden and crusty.  Cool on a wire rack.  Just before serving the stollen, sift the confectioners'' sugar over the top.**'\n\nPrepare time: X\nCook time: X\nTotal time: X","id":71},{"name":"Pizza Crust II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3957487.jpg","description":"Dissolve yeast and sugar in 1 1\/2 cups warm water.  Let stand 5 to 6 minutes, until mixture is foamy.**In a large bowl, mix together half the flour, remaining water, garlic powder, salt, oregano, and margarine. Add yeast mixture, and stir to combine.  Work in remaining flour 1\/2 cup at a time until a soft dough forms.**Transfer dough to a lightly floured surface, and knead for 10 minutes.  Put dough in large plastic bag, and place in refrigerator. Let rise until tripled in bulk.**For a round pizza, break off about 2 cups of the dough. Grease a 15 inch round pan, and sprinkle lightly with corn meal.  Roll out the dough to fit the pan, stretching it to fit.  Brush crust with olive oil, and sprinkle with cheese.  Add desired toppings.**Bake at 450 degrees F (230 degrees C) for 18 to 20 minutes.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":72},{"name":"Pistachio Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3799693.jpg","description":"Preheat oven to 350 degrees F (175 degrees C).  Grease and flour two 9 x 5 inch loaf pans.**Mix together cake mix, eggs, oil, water, pudding mix, sour cream, cherries, and food coloring.  Pour into prepared pans.  In a small bowl, stir together cinnamon and sugar. Sprinkle tops of loaves with mixture.**Bake for 45 minutes.  Cool.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":73},{"name":"Grill Dough Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/102091.jpg","description":"Proof yeast in warm water.**In separate bowl place flour, salt, sugar, and oil. Make a well in the center and place yeast\/warm water mixture in. Mix thoroughly until consistency of an elastic ball. Allow to rise 1 1\/2hours.**Flour surface and roll out 1\/2 dough. Rub with cornmeal. Sprinkle with your favorite toppings.**Spray grill with cooking spray. Grill dough about 5 minutes or until toppings are melted. Repeat with second piece of dough.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":74},{"name":"German Rye Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3306958.jpg","description":"Dissolve yeast in warm water.**In a large bowl combine milk, sugar, and salt. Use a mixer to beat in molasses, butter, yeast mixture, and 1 cup of rye flour.**Use a wooden spoon to mix in the remaining rye flour. Add white flour by stirring until the dough is stiff enough to knead.**Knead 5 to 10 minutes, adding flour as needed. If the dough sticks to your hands or the board add more flour.**Cover dough and let rise 1 to 1 1\/2 hours or until double.**Punch down dough and divide to form two round loaves. Let loaves rise on a greased baking sheet until double, about 1 1\/2 hours.**Preheat oven to 375 degrees F (190 degrees C). Bake for 30 to 35 minutes.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":75},{"name":"Spelt Bread I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/677578.jpg","description":"Stir yeast and sugar, gradually adding warm water. Add about half the flour and the salt and beat well. Add the remainder of the flour gradually to acquire a stiff dough. It may require more or less than 7 cups.**Knead 5 to 10 minutes until smooth and elastic.**Put dough into a buttered bowl and turn once to butter surface. Cover with a towel and let rise until doubled, keeping it between 80 and 90 degrees F during the entire time of rising, about 2 hours.**Punch down dough with your fist and divide into two parts. Knead and shape into 2 loaves and place into loaf pans. Cover again and allow dough to rise to top of pans.**Preheat the oven to 350 degrees F (175 degrees C). Grease two 9x5 inch loaf pans.**Bake at 350 degrees F (175 degrees C) for 50 minutes.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":76},{"name":"Essene Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1009396.jpg","description":"'Beginning several days before you hope to be eating this bread, rinse the wheat berries in cool water, drain and submerge the berries with cool water in a large bowl. Cover the bowl with a plate or cloth, and allow the berries to soak at normal room temperature overnight or for about 12 hours. The berries will soak up a considerable amount of water. Drain the berries in a colander, cover the colander with a plate to prevent the berries from drying out, and set it in a place away from light and where the sun won''t shine on it.  Rinse the berries about 3 times a day, and they will soon begin to sprout. In a couple of days the sprouts will reach their optimum length of about l\/4 inch. Growth depends on moisture and temperature so be patient.**Grind in a food mill or in a food processor.**After grinding, dump the mushed up grain onto a clean work surface. Squeeze and knead the grain for about 10 minutes, and then form up 2 small round, hearth-style loaves with your hands. Sprinkle an insulated cookie sheet with a little bran or cornmeal, and put the loaves on it.**Preheating the oven is not necessary. Cover the loaves with cloches, and bake at 350 degrees F (175 degrees C) for 30 minutes. Then turn the oven down to 325 degrees F (165 degrees C), and bake for approximately 2 hours and 15 minutes more. Allow the breads to cool thoroughly on cooling racks for several hours, and then, because of the high moisture content, store in the refrigerator. For best results, slice this bread thinly, or break with hands**'\n\nPrepare time: X\nCook time: X\nTotal time: X","id":77},{"name":"Apple Bran Cheddar Muffins Recipe ","image":"https:\/\/images.media-allrecipes.com\/images\/79591.png","description":"Preheat oven to 375 degrees F (190 degrees C). Grease one 12-cup muffin tin or line with paper liners.**Combine the bran cereal, milk and apples. Mix well. Beat in the vegetable oil and egg.**Combine the flour, baking powder, salt, cinnamon and brown sugar. Make a well in the center and stir in the wet mixture. Add the shredded cheese and mix enough until just moistened. Scoop the batter into the prepared pans.**Bake at 375 degrees F (190 degrees C) for 15 to 20 minutes.**\n\nPrepare time: 15 m\nCook time: 20 m\nTotal time: 35 m","id":78},{"name":"Quick and Easy Monkey Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1909168.jpg","description":"The night or several hours before, grease and flour a 9 or 10 inch tube pan. Mix brown sugar and pudding mix together.  Mix white sugar and cinnamon together. Place frozen dinner rolls in pan a layer at a time.  Sprinkle brown sugar and pudding mix over first layer of rolls. Sprinkle sugar and cinnamon mixture over the brown sugar and  pudding mixture.  Spread half the nuts and melted butter over first layer.  Repeat with the next layer.**Place on counter over night. Do not cover. Next morning bake in a preheated 350 degrees F (175 degrees C) oven for 30 minutes. Let stand a few minutes and turn pan over onto serving platter.**\n\nPrepare time: 10 m\nCook time: 30 m\nTotal time: 40 m","id":79},{"name":"Spiced Apple Muffins Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/194243.jpg","description":"Mix together sugar, cinnamon, ginger, and anise seeds.**In a large bowl, mix flour, baking powder, sugar mixture, salt, milk, and applesauce.  Do not overbeat.  Stir in diced apples.  Spoon batter into 12 greased muffin cups.**Bake at 400 degrees F (205 degrees C) for 20 to 25 minutes, or until tops spring back when lightly touched.  Serve after muffins have cooled a bit, about 30 minutes.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":80},{"name":"Banana Chip Muffins II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/2884.jpg","description":"Preheat oven to 400 degrees F (205 degrees C).  Coat a 12 cup muffin tin with nonstick spray.**Whisk together flour, baking powder, soda, cinnamon, salt, and sugar.  Mix in egg whites, applesauce, and banana mash until just moistened.  Stir in chocolate chips.   Divide batter into muffin cups.**Bake for 15 to 18 minutes.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":81},{"name":"Mocha Muffins Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/74887.jpg","description":"Preheat oven to 400 degrees F (205 degrees C).  Grease muffin cups.**Mix together egg, egg whites, and milk. Stir in coffee powder, water, and vanilla.**In a large bowl, mix together flour, malted milk powder, 1\/2 cup sugar, baking powder, and salt.  Stir in liquid mixture. Mix together really well, until batter is thin and gooey like cake batter.  Fill muffin cups 2\/3 full.  In a small bowl, stir together cinnamon and 2 tablespoons sugar. Sprinkle cinnamon sugar over muffins.**Bake in preheated oven for 20 to 25 minutes.**\n\nPrepare time: 10 m\nCook time: 25 m\nTotal time: 35 m","id":82},{"name":"Banana Bread ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/59947.jpg","description":"Place ingredients in the pan of the bread machine.**Select the Dough setting, and press Start. Mix the bread for 3 to 5 minutes until the bananas are mashed and all ingredients are thoroughly combined. If necessary, use a rubber spatula to push the dough from the sides of the bread pan. When 3 to 5 minutes have passed on the clock display, press Stop. Do not continue mixing. Smooth out the top of the loaf with the rubber spatula.**Select the Bake setting, and press Start. The Bake cycle time may vary with machines, but should be about 50 minutes. To test the bread for doneness, insert a toothpick into the center top. Remove the toothpick. If the bread is done, the toothpick will come out clean. If there is batter on the toothpick, reset the machine on Bake and continue to bake an additional 10 to 15 minutes. Test again with the toothpick to ensure the bread is completely baked. Remove the pan from the machine, but allow the bread to remain in the pan for 10 minutes. Remove the bread to cool completely on a wire rack.**\n\nPrepare time: 15 m\nCook time: 50 m\nTotal time: 1 h 15 m","id":83},{"name":"Dark Rye Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/1009871.jpg","description":"Place ingredients in the pan of the bread machine in the order recommended by the manufacturer.**Select the Basic cycle, and press Start.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":84},{"name":"Mediterranean Black Olive Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/227162.jpg","description":"In a large bowl, mix together flour, yeast, sugar, salt, black olives, olive oil, and water.**Turn out dough onto a floured board.  Knead until smooth and elastic, 5 to 10 minutes.  Set aside, and let rise about 45 minutes, until it doubles in size.  Punch down.  Knead well again, for about 5 to 10 minutes. Let rise for about 30 minutes, until it doubles in size.**Round the dough on kneading board.  Place upside down in a bowl lined with a lint-free, well floured towel.  Let rise until double in size.**While the bread is rising for the third time, put a pan of water in the bottom of the oven.  Preheat oven to 500 degrees F (260 degrees C).**Gently turn loaf out onto a sheet pan that has been lightly oiled and dusted with cornmeal.**Bake loaf at 500 degrees F (260 degrees C) for 15 minutes.  Reduce heat to 375 degrees F (190 degrees C).  Bake for 30 more minutes, or until done.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":85},{"name":"Italian Herb Bread II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/608807.jpg","description":"Place ingredients in the pan of the bread machine in the order recommended by the manufacturer.**Select the Medium Crust and Basic\/White Bread settings, and press Start.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":86},{"name":"Batter White Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/524816.jpg","description":"Mix together shortening, sugar, salt, yeast, and 1 1\/5 cups flour. Add warm water and beat by hand about 300 strokes, or 3 minutes, with an electric mixer. Add remaining flour, scraping bowl often, and mix all together until smooth.**Cover with a clean cloth and let rise until doubled in volume.**Stir dough down gently, and spoon into a lightly greased 9x5 inch loaf pan (the batter should be sticky). Pat down with floured hands to help shape. Cover again, and let rise for about 30 minutes.**Preheat oven to 375 degrees F (190 degrees C).**Bake for about 45 minutes. Place on a cooling rack, and brush top with melted butter.**\n\nPrepare time: 25 m\nCook time: 45 m\nTotal time: 2 h 40 m","id":87},{"name":"Authentic Mexican Tortillas Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3620460.jpg","description":"Combine the flour, baking powder, and salt. Either by hand or with a pastry cutter, cut in the shortening till the mixture is crumbly. If the mixture looks more floury than crumbly, be sure to add just one or two more tablespoons of shortening till it is crumbly. Add about 3\/4 cup hot water to the mixture, or just enough to make the ingredients look moist.**With your hand or a large fork, knead the mixture making sure to rub the dough against the sides of the large mixing bowl to gather any clinging dough. If the dough still sticks to the side of  the bowl, add a couple more tablespoons of flour until the dough forms a soft round shape. The dough is ready to roll out now, but it is best to let it rest. Cover it with a dish towel, and let it sit for about an hour or so.**Take the dough, and pull it apart into 10 to 12 balls. Lightly flour your rolling area, and roll each ball with a rolling pin to about 1\/8 inch thickness.**Place each tortilla on a medium hot cast iron skillet. Cook for about 1 to 2 minutes on each side, or until the tortilla does not look doughy.**\n\nPrepare time: 30 m\nCook time: 25 m\nTotal time: 55 m","id":88},{"name":"Johnnycakes Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/97765.jpg","description":"Cream the cornmeal, salt, and butter together. Add the milk and enough water to make a moist but firm batter.**Drop by large spoonfuls onto a hot greased griddle, and flatten slightly with the back of a spoon. When brown, turn and cook the other side.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":89},{"name":"'Julia''s Hot Cross Buns Recipe '","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/33942.jpg","description":"'Place milk, 3\/8 cup water, egg, salt, white sugar, butter or margarine, cinnamon, nutmeg, peel, bread flour, yeast, and raisins in the pan of the bread machine.  Select the Dough setting, and Start.**Form into 15 rolls.  Place into a greased 13 x 9 inch pan.  Let rise for one hour.**Bake at 375 degrees F (190 degrees C) for 20 to 25 minutes. Cool.**Make icing with confectioners'' sugar and 1 tablespoon water.  Drizzle over buns in the shape of cross.**'\n\nPrepare time: X\nCook time: X\nTotal time: X","id":90},{"name":"High Flavor Bran Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/2751284.jpg","description":"Place ingredients in order indicated by your manufacturer. Select the whole wheat or whole grain setting.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":91},{"name":"Oat Bran Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3801017.jpg","description":"Place ingredients in the pan of the bread machine in the order suggested by the manufacturer. Select the Dough setting, and Start.**After the dough has risen once, remove it from the machine.  Knead it a few times, and then shape into a loaf.  Place in a greased 9 x 5 inch loaf pan.  Allow to rise until doubled in bulk.**Bake at 350 degrees F (175 degrees C) for 35 to 40 minutes, or until done.**Alternatively, choose the Basic or White Bread setting, and Start.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":92},{"name":"Oatmeal Bread III Recipe ","image":"https:\/\/images.media-allrecipes.com\/images\/79591.png","description":"Sift together oat flour, rice flour, soy flour, baking powder, arrowroot powder, sea salt, and cinnamon.  Stir in rolled oats.**In a large bowl, mix together soy milk, honey, oil, and lecithin.  Stir in the flour mixture, and mix well.  The batter will be stiff.  Scoop batter into a lightly oiled 9 x 5 inch loaf pan, and smooth into place.**Bake at 375 degrees F (190 degrees C) for 75 minutes, or until the loaf is firm and lightly browned.  A toothpick inserted in the center should come out clean.  If loaf gets too dark before it is done, tent with aluminum foil for the remainder of the baking time. Cool completely before removing from pan and slicing.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":93},{"name":"Blueberry Bread II Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/3444.jpg","description":"Place all ingredients in the pan of the bread machine in the order suggested by the manufacturer.**Select White Bread cycle, and Start.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":94},{"name":"Pear","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/14861.jpg","description":"Preheat oven to 375 degrees F (190 degrees C).  Butter 15 muffin cups, or line with paper liner cups.**Mix together flours, soda, baking powder, salt, cinnamon, and nutmeg.   Stir pears lightly into dry ingredients.**In a large bowl, combine yogurt, oil, honey, and egg.  Mix in flour mixture until just combined. Spoon into muffin cups.**Bake for 20 to 25 minutes, or until done.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":95},{"name":"Basic Sourdough Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/127709.jpg","description":"Allow starter to come to room temperature.**Place all ingredients in the bread machine in the order suggested by the manufacturer.**Select Basic or White Bread cycle, and Medium crust setting.  Start.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":96},{"name":"Bread Pudding with Lemon Sauce I Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/5143435.jpg","description":"Preheat oven to 350 degrees F (175 degrees C). Spray an 8x11 inch casserole with nonstick spray.**In a large bowl, combine bread cubes, 1 cup sugar, salt, cinnamon, and nutmeg.  Mix in raisins, if desired.**In another bowl, blend milk, melted butter, and eggs.  Add wet ingredients to dry, and mix together without turning bread mixture into mush. Pour mixture into prepared casserole dish.**Place casserole dish into a larger baking pan. Pour hot water into baking pan about 1\/3 up the side of the casserole dish, creating a water bath.  Bake for 45 minutes.**In a small saucepan, combine 1\/2 cup sugar, cornstarch, 1 cup hot water, 2 tablespoons butter, lemon juice, and lemon zest. Cook on medium heat until bubbling and thickened. Stir constantly to avoid scorching. Serve with bread pudding.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":97},{"name":"Fondue Bread Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/560x315\/3488723.jpg","description":"Heat milk and butter or margarine over low heat until very warm.**Combine sugar, salt, yeast, and 1 cup of flour in a large bowl.  Stir in hot milk mixture, and beat with mixer on medium speed for 2 minutes.  Beat in 1 more cup of flour, and continue beating for 2 more minutes.   With a wooden spoon, stir in enough flour (about 2 cups) to make a soft dough.**Knead the dough on a lightly floured surface for about 10 minutes, adding more flour as necessary. Cover dough with bowl, and let rest for 15 minutes.**Meanwhile, shred muenster cheese.  Combine with 1 egg and 1 egg yolk.**On a lightly floured surface and with a floured rolling pin, roll dough into a 24 x 6 inch rectangle. Spoon the cheese mixture into a log shape lengthwise along the dough.  Fold the dough over the cheese making a 1 inch overlap, and pinch seam to seal.  In a greased 9 inch round cake pan, place roll, seam side down, to make a ring.  Overlap the ends, and pinch to seal.  Cover with a towel.  Let rest 10 minutes.**Brush loaf with egg white, and garnish with blanched almonds, if desired.  Bake at 350 degrees F (175 degrees C) for 1 hour, until loaf sounds hollow when tapped. Remove bread from pan immediately.  Cool for 15 minutes before slicing into wedges.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":98},{"name":"Southern Butter Rolls Recipe ","image":"https:\/\/images.media-allrecipes.com\/userphotos\/250x250\/44901.jpg","description":"Mix together flour, sugar, salt, and instant yeast.  Mix in shortening.  Mix in water.**Turn out onto a lightly floured surface.  Knead by hand for 20 minutes.  Cover dough with oil.   Place dough in a bowl, cover, and proof for 1 hour.**Form rolls, and place on a greased baking tray. Proof for 45 minutes.**Bake at 400 degrees F (205 degrees C) for 12  to 14 minutes.**\n\nPrepare time: X\nCook time: X\nTotal time: X","id":99}]},"ingredients":{"0":[{"recipe_id":0,"product_id":60,"id":0},{"recipe_id":1,"product_id":13,"id":1},{"recipe_id":2,"product_id":13,"id":2},{"recipe_id":3,"product_id":13,"id":3},{"recipe_id":4,"product_id":97,"id":4},{"recipe_id":5,"product_id":31,"id":5},{"recipe_id":6,"product_id":31,"id":6},{"recipe_id":7,"product_id":75,"id":7},{"recipe_id":8,"product_id":76,"id":8},{"recipe_id":9,"product_id":23,"id":9},{"recipe_id":10,"product_id":13,"id":10},{"recipe_id":11,"product_id":91,"id":11},{"recipe_id":12,"product_id":60,"id":12},{"recipe_id":13,"product_id":29,"id":13},{"recipe_id":14,"product_id":52,"id":14},{"recipe_id":15,"product_id":75,"id":15},{"recipe_id":16,"product_id":78,"id":16},{"recipe_id":17,"product_id":31,"id":17},{"recipe_id":18,"product_id":75,"id":18},{"recipe_id":19,"product_id":91,"id":19},{"recipe_id":20,"product_id":13,"id":20},{"recipe_id":21,"product_id":72,"id":21},{"recipe_id":22,"product_id":75,"id":22},{"recipe_id":23,"product_id":13,"id":23},{"recipe_id":24,"product_id":13,"id":24},{"recipe_id":25,"product_id":75,"id":25},{"recipe_id":26,"product_id":13,"id":26},{"recipe_id":27,"product_id":52,"id":27},{"recipe_id":28,"product_id":60,"id":28},{"recipe_id":29,"product_id":107,"id":29},{"recipe_id":30,"product_id":90,"id":30},{"recipe_id":31,"product_id":52,"id":31},{"recipe_id":32,"product_id":75,"id":32},{"recipe_id":33,"product_id":75,"id":33},{"recipe_id":34,"product_id":13,"id":34},{"recipe_id":35,"product_id":9,"id":35},{"recipe_id":36,"product_id":75,"id":36},{"recipe_id":37,"product_id":28,"id":37},{"recipe_id":38,"product_id":75,"id":38},{"recipe_id":39,"product_id":60,"id":39},{"recipe_id":40,"product_id":107,"id":40},{"recipe_id":41,"product_id":91,"id":41},{"recipe_id":42,"product_id":60,"id":42},{"recipe_id":43,"product_id":13,"id":43},{"recipe_id":44,"product_id":13,"id":44},{"recipe_id":45,"product_id":52,"id":45},{"recipe_id":46,"product_id":31,"id":46},{"recipe_id":47,"product_id":60,"id":47},{"recipe_id":48,"product_id":13,"id":48},{"recipe_id":49,"product_id":75,"id":49},{"recipe_id":50,"product_id":60,"id":50},{"recipe_id":51,"product_id":75,"id":51},{"recipe_id":52,"product_id":75,"id":52},{"recipe_id":53,"product_id":75,"id":53},{"recipe_id":54,"product_id":75,"id":54},{"recipe_id":55,"product_id":52,"id":55},{"recipe_id":56,"product_id":75,"id":56},{"recipe_id":57,"product_id":41,"id":57},{"recipe_id":58,"product_id":75,"id":58},{"recipe_id":59,"product_id":75,"id":59},{"recipe_id":60,"product_id":75,"id":60},{"recipe_id":61,"product_id":25,"id":61},{"recipe_id":62,"product_id":13,"id":62},{"recipe_id":63,"product_id":13,"id":63},{"recipe_id":64,"product_id":91,"id":64},{"recipe_id":65,"product_id":38,"id":65},{"recipe_id":66,"product_id":75,"id":66},{"recipe_id":67,"product_id":75,"id":67},{"recipe_id":68,"product_id":60,"id":68},{"recipe_id":69,"product_id":83,"id":69},{"recipe_id":70,"product_id":13,"id":70},{"recipe_id":71,"product_id":73,"id":71},{"recipe_id":72,"product_id":75,"id":72},{"recipe_id":73,"product_id":8,"id":73},{"recipe_id":74,"product_id":13,"id":74},{"recipe_id":75,"product_id":60,"id":75},{"recipe_id":76,"product_id":60,"id":76},{"recipe_id":77,"product_id":80,"id":77},{"recipe_id":78,"product_id":19,"id":78},{"recipe_id":79,"product_id":38,"id":79},{"recipe_id":80,"product_id":59,"id":80},{"recipe_id":81,"product_id":13,"id":81},{"recipe_id":82,"product_id":107,"id":82},{"recipe_id":83,"product_id":13,"id":83},{"recipe_id":84,"product_id":75,"id":84},{"recipe_id":85,"product_id":91,"id":85},{"recipe_id":86,"product_id":75,"id":86},{"recipe_id":87,"product_id":60,"id":87},{"recipe_id":88,"product_id":13,"id":88},{"recipe_id":89,"product_id":23,"id":89},{"recipe_id":90,"product_id":52,"id":90},{"recipe_id":91,"product_id":75,"id":91},{"recipe_id":92,"product_id":75,"id":92},{"recipe_id":93,"product_id":52,"id":93},{"recipe_id":94,"product_id":91,"id":94},{"recipe_id":95,"product_id":13,"id":95},{"recipe_id":96,"product_id":25,"id":96},{"recipe_id":97,"product_id":91,"id":97},{"recipe_id":98,"product_id":4,"id":98},{"recipe_id":99,"product_id":13,"id":99},{"recipe_id":0,"product_id":75,"id":100},{"recipe_id":1,"product_id":62,"id":101},{"recipe_id":2,"product_id":107,"id":102},{"recipe_id":3,"product_id":79,"id":103},{"recipe_id":4,"product_id":78,"id":104},{"recipe_id":5,"product_id":4,"id":105},{"recipe_id":6,"product_id":75,"id":106},{"recipe_id":7,"product_id":113,"id":107},{"recipe_id":8,"product_id":4,"id":108},{"recipe_id":9,"product_id":52,"id":109},{"recipe_id":10,"product_id":4,"id":110},{"recipe_id":11,"product_id":107,"id":111},{"recipe_id":12,"product_id":75,"id":112},{"recipe_id":13,"product_id":76,"id":113},{"recipe_id":14,"product_id":86,"id":114},{"recipe_id":15,"product_id":60,"id":115},{"recipe_id":16,"product_id":7,"id":116},{"recipe_id":17,"product_id":4,"id":117},{"recipe_id":18,"product_id":76,"id":118},{"recipe_id":19,"product_id":45,"id":119},{"recipe_id":20,"product_id":97,"id":120},{"recipe_id":21,"product_id":62,"id":121},{"recipe_id":22,"product_id":92,"id":122},{"recipe_id":23,"product_id":79,"id":123},{"recipe_id":24,"product_id":4,"id":124},{"recipe_id":25,"product_id":100,"id":125},{"recipe_id":26,"product_id":79,"id":126},{"recipe_id":27,"product_id":107,"id":127},{"recipe_id":28,"product_id":97,"id":128},{"recipe_id":29,"product_id":4,"id":129},{"recipe_id":30,"product_id":4,"id":130},{"recipe_id":31,"product_id":100,"id":131},{"recipe_id":32,"product_id":52,"id":132},{"recipe_id":33,"product_id":91,"id":133},{"recipe_id":34,"product_id":82,"id":134},{"recipe_id":35,"product_id":13,"id":135},{"recipe_id":36,"product_id":92,"id":136},{"recipe_id":37,"product_id":110,"id":137},{"recipe_id":38,"product_id":45,"id":138},{"recipe_id":39,"product_id":13,"id":139},{"recipe_id":40,"product_id":37,"id":140},{"recipe_id":41,"product_id":86,"id":141},{"recipe_id":42,"product_id":4,"id":142},{"recipe_id":43,"product_id":111,"id":143},{"recipe_id":44,"product_id":4,"id":144},{"recipe_id":45,"product_id":86,"id":145},{"recipe_id":46,"product_id":4,"id":146},{"recipe_id":47,"product_id":49,"id":147},{"recipe_id":48,"product_id":44,"id":148},{"recipe_id":49,"product_id":26,"id":149},{"recipe_id":50,"product_id":52,"id":150},{"recipe_id":51,"product_id":25,"id":151},{"recipe_id":52,"product_id":52,"id":152},{"recipe_id":53,"product_id":107,"id":153},{"recipe_id":54,"product_id":107,"id":154},{"recipe_id":55,"product_id":107,"id":155},{"recipe_id":56,"product_id":62,"id":156},{"recipe_id":57,"product_id":24,"id":157},{"recipe_id":58,"product_id":91,"id":158},{"recipe_id":59,"product_id":76,"id":159},{"recipe_id":60,"product_id":62,"id":160},{"recipe_id":61,"product_id":75,"id":161},{"recipe_id":62,"product_id":103,"id":162},{"recipe_id":63,"product_id":4,"id":163},{"recipe_id":65,"product_id":76,"id":165},{"recipe_id":66,"product_id":34,"id":166},{"recipe_id":67,"product_id":76,"id":167},{"recipe_id":68,"product_id":75,"id":168},{"recipe_id":69,"product_id":52,"id":169},{"recipe_id":70,"product_id":79,"id":170},{"recipe_id":71,"product_id":50,"id":171},{"recipe_id":72,"product_id":4,"id":172},{"recipe_id":73,"product_id":107,"id":173},{"recipe_id":74,"product_id":62,"id":174},{"recipe_id":75,"product_id":75,"id":175},{"recipe_id":76,"product_id":4,"id":176},{"recipe_id":77,"product_id":75,"id":177},{"recipe_id":78,"product_id":52,"id":178},{"recipe_id":79,"product_id":82,"id":179},{"recipe_id":80,"product_id":29,"id":180},{"recipe_id":81,"product_id":79,"id":181},{"recipe_id":82,"product_id":107,"id":182},{"recipe_id":83,"product_id":79,"id":183},{"recipe_id":84,"product_id":3,"id":184},{"recipe_id":85,"product_id":60,"id":185},{"recipe_id":86,"product_id":91,"id":186},{"recipe_id":87,"product_id":31,"id":187},{"recipe_id":88,"product_id":79,"id":188},{"recipe_id":89,"product_id":62,"id":189},{"recipe_id":90,"product_id":75,"id":190},{"recipe_id":91,"product_id":52,"id":191},{"recipe_id":92,"product_id":76,"id":192},{"recipe_id":93,"product_id":49,"id":193},{"recipe_id":94,"product_id":4,"id":194},{"recipe_id":95,"product_id":45,"id":195},{"recipe_id":96,"product_id":75,"id":196},{"recipe_id":97,"product_id":52,"id":197},{"recipe_id":98,"product_id":62,"id":198},{"recipe_id":99,"product_id":31,"id":199},{"recipe_id":0,"product_id":4,"id":200},{"recipe_id":1,"product_id":79,"id":201},{"recipe_id":2,"product_id":4,"id":202},{"recipe_id":3,"product_id":72,"id":203},{"recipe_id":4,"product_id":86,"id":204},{"recipe_id":5,"product_id":62,"id":205},{"recipe_id":6,"product_id":82,"id":206},{"recipe_id":7,"product_id":86,"id":207},{"recipe_id":8,"product_id":107,"id":208},{"recipe_id":9,"product_id":107,"id":209},{"recipe_id":10,"product_id":79,"id":210},{"recipe_id":11,"product_id":52,"id":211},{"recipe_id":12,"product_id":78,"id":212},{"recipe_id":13,"product_id":4,"id":213},{"recipe_id":14,"product_id":3,"id":214},{"recipe_id":15,"product_id":4,"id":215},{"recipe_id":16,"product_id":4,"id":216},{"recipe_id":17,"product_id":107,"id":217},{"recipe_id":18,"product_id":62,"id":218},{"recipe_id":19,"product_id":97,"id":219},{"recipe_id":20,"product_id":62,"id":220},{"recipe_id":21,"product_id":109,"id":221},{"recipe_id":22,"product_id":91,"id":222},{"recipe_id":23,"product_id":72,"id":223},{"recipe_id":24,"product_id":79,"id":224},{"recipe_id":25,"product_id":107,"id":225},{"recipe_id":26,"product_id":62,"id":226},{"recipe_id":27,"product_id":76,"id":227},{"recipe_id":28,"product_id":91,"id":228},{"recipe_id":29,"product_id":115,"id":229},{"recipe_id":30,"product_id":107,"id":230},{"recipe_id":31,"product_id":62,"id":231},{"recipe_id":32,"product_id":3,"id":232},{"recipe_id":33,"product_id":49,"id":233},{"recipe_id":34,"product_id":4,"id":234},{"recipe_id":35,"product_id":4,"id":235},{"recipe_id":36,"product_id":91,"id":236},{"recipe_id":37,"product_id":74,"id":237},{"recipe_id":38,"product_id":62,"id":238},{"recipe_id":39,"product_id":91,"id":239},{"recipe_id":40,"product_id":100,"id":240},{"recipe_id":41,"product_id":4,"id":241},{"recipe_id":42,"product_id":62,"id":242},{"recipe_id":43,"product_id":108,"id":243},{"recipe_id":44,"product_id":77,"id":244},{"recipe_id":45,"product_id":84,"id":245},{"recipe_id":46,"product_id":34,"id":246},{"recipe_id":47,"product_id":75,"id":247},{"recipe_id":48,"product_id":75,"id":248},{"recipe_id":49,"product_id":60,"id":249},{"recipe_id":50,"product_id":107,"id":250},{"recipe_id":51,"product_id":62,"id":251},{"recipe_id":52,"product_id":86,"id":252},{"recipe_id":53,"product_id":52,"id":253},{"recipe_id":54,"product_id":52,"id":254},{"recipe_id":55,"product_id":76,"id":255},{"recipe_id":56,"product_id":48,"id":256},{"recipe_id":57,"product_id":62,"id":257},{"recipe_id":58,"product_id":52,"id":258},{"recipe_id":59,"product_id":4,"id":259},{"recipe_id":60,"product_id":45,"id":260},{"recipe_id":61,"product_id":76,"id":261},{"recipe_id":62,"product_id":72,"id":262},{"recipe_id":63,"product_id":105,"id":263},{"recipe_id":65,"product_id":118,"id":265},{"recipe_id":66,"product_id":76,"id":266},{"recipe_id":67,"product_id":91,"id":267},{"recipe_id":68,"product_id":4,"id":268},{"recipe_id":69,"product_id":4,"id":269},{"recipe_id":70,"product_id":4,"id":270},{"recipe_id":71,"product_id":55,"id":271},{"recipe_id":72,"product_id":60,"id":272},{"recipe_id":73,"product_id":86,"id":273},{"recipe_id":74,"product_id":4,"id":274},{"recipe_id":75,"product_id":52,"id":275},{"recipe_id":76,"product_id":13,"id":276},{"recipe_id":77,"product_id":23,"id":277},{"recipe_id":78,"product_id":59,"id":278},{"recipe_id":79,"product_id":100,"id":279},{"recipe_id":80,"product_id":52,"id":280},{"recipe_id":81,"product_id":72,"id":281},{"recipe_id":82,"product_id":52,"id":282},{"recipe_id":83,"product_id":72,"id":283},{"recipe_id":84,"product_id":86,"id":284},{"recipe_id":85,"product_id":4,"id":285},{"recipe_id":86,"product_id":52,"id":286},{"recipe_id":87,"product_id":75,"id":287},{"recipe_id":88,"product_id":62,"id":288},{"recipe_id":89,"product_id":100,"id":289},{"recipe_id":90,"product_id":107,"id":290},{"recipe_id":91,"product_id":86,"id":291},{"recipe_id":92,"product_id":91,"id":292},{"recipe_id":93,"product_id":86,"id":293},{"recipe_id":94,"product_id":62,"id":294},{"recipe_id":95,"product_id":72,"id":295},{"recipe_id":96,"product_id":13,"id":296},{"recipe_id":97,"product_id":100,"id":297},{"recipe_id":98,"product_id":60,"id":298},{"recipe_id":99,"product_id":4,"id":299},{"recipe_id":0,"product_id":62,"id":300},{"recipe_id":1,"product_id":77,"id":301},{"recipe_id":2,"product_id":86,"id":302},{"recipe_id":3,"product_id":62,"id":303},{"recipe_id":4,"product_id":107,"id":304},{"recipe_id":5,"product_id":52,"id":305},{"recipe_id":6,"product_id":60,"id":306},{"recipe_id":7,"product_id":107,"id":307},{"recipe_id":8,"product_id":34,"id":308},{"recipe_id":9,"product_id":93,"id":309},{"recipe_id":10,"product_id":62,"id":310},{"recipe_id":11,"product_id":109,"id":311},{"recipe_id":12,"product_id":13,"id":312},{"recipe_id":13,"product_id":82,"id":313},{"recipe_id":14,"product_id":91,"id":314},{"recipe_id":15,"product_id":13,"id":315},{"recipe_id":16,"product_id":72,"id":316},{"recipe_id":17,"product_id":34,"id":317},{"recipe_id":18,"product_id":13,"id":318},{"recipe_id":19,"product_id":117,"id":319},{"recipe_id":20,"product_id":79,"id":320},{"recipe_id":21,"product_id":63,"id":321},{"recipe_id":22,"product_id":13,"id":322},{"recipe_id":23,"product_id":62,"id":323},{"recipe_id":24,"product_id":72,"id":324},{"recipe_id":25,"product_id":115,"id":325},{"recipe_id":26,"product_id":4,"id":326},{"recipe_id":27,"product_id":91,"id":327},{"recipe_id":28,"product_id":62,"id":328},{"recipe_id":29,"product_id":86,"id":329},{"recipe_id":30,"product_id":13,"id":330},{"recipe_id":31,"product_id":4,"id":331},{"recipe_id":32,"product_id":49,"id":332},{"recipe_id":33,"product_id":52,"id":333},{"recipe_id":34,"product_id":21,"id":334},{"recipe_id":35,"product_id":28,"id":335},{"recipe_id":36,"product_id":13,"id":336},{"recipe_id":37,"product_id":53,"id":337},{"recipe_id":38,"product_id":49,"id":338},{"recipe_id":39,"product_id":23,"id":339},{"recipe_id":40,"product_id":13,"id":340},{"recipe_id":41,"product_id":107,"id":341},{"recipe_id":42,"product_id":13,"id":342},{"recipe_id":43,"product_id":65,"id":343},{"recipe_id":44,"product_id":79,"id":344},{"recipe_id":45,"product_id":107,"id":345},{"recipe_id":46,"product_id":107,"id":346},{"recipe_id":47,"product_id":13,"id":347},{"recipe_id":48,"product_id":60,"id":348},{"recipe_id":49,"product_id":73,"id":349},{"recipe_id":50,"product_id":100,"id":350},{"recipe_id":51,"product_id":91,"id":351},{"recipe_id":52,"product_id":4,"id":352},{"recipe_id":53,"product_id":49,"id":353},{"recipe_id":54,"product_id":4,"id":354},{"recipe_id":55,"product_id":4,"id":355},{"recipe_id":56,"product_id":13,"id":356},{"recipe_id":57,"product_id":91,"id":357},{"recipe_id":58,"product_id":4,"id":358},{"recipe_id":59,"product_id":62,"id":359},{"recipe_id":60,"product_id":94,"id":360},{"recipe_id":61,"product_id":4,"id":361},{"recipe_id":62,"product_id":62,"id":362},{"recipe_id":65,"product_id":68,"id":365},{"recipe_id":66,"product_id":107,"id":366},{"recipe_id":67,"product_id":4,"id":367},{"recipe_id":68,"product_id":13,"id":368},{"recipe_id":69,"product_id":31,"id":369},{"recipe_id":70,"product_id":62,"id":370},{"recipe_id":71,"product_id":101,"id":371},{"recipe_id":72,"product_id":62,"id":372},{"recipe_id":73,"product_id":75,"id":373},{"recipe_id":74,"product_id":60,"id":374},{"recipe_id":75,"product_id":4,"id":375},{"recipe_id":76,"product_id":75,"id":376},{"recipe_id":78,"product_id":86,"id":378},{"recipe_id":79,"product_id":4,"id":379},{"recipe_id":80,"product_id":62,"id":380},{"recipe_id":81,"product_id":109,"id":381},{"recipe_id":82,"product_id":87,"id":382},{"recipe_id":83,"product_id":4,"id":383},{"recipe_id":84,"product_id":62,"id":384},{"recipe_id":85,"product_id":62,"id":385},{"recipe_id":86,"product_id":4,"id":386},{"recipe_id":87,"product_id":4,"id":387},{"recipe_id":88,"product_id":31,"id":388},{"recipe_id":89,"product_id":52,"id":389},{"recipe_id":90,"product_id":62,"id":390},{"recipe_id":91,"product_id":3,"id":391},{"recipe_id":92,"product_id":85,"id":392},{"recipe_id":93,"product_id":89,"id":393},{"recipe_id":94,"product_id":86,"id":394},{"recipe_id":95,"product_id":109,"id":395},{"recipe_id":96,"product_id":4,"id":396},{"recipe_id":97,"product_id":4,"id":397},{"recipe_id":98,"product_id":13,"id":398},{"recipe_id":99,"product_id":62,"id":399},{"recipe_id":0,"product_id":107,"id":400},{"recipe_id":1,"product_id":100,"id":401},{"recipe_id":2,"product_id":29,"id":402},{"recipe_id":3,"product_id":109,"id":403},{"recipe_id":4,"product_id":82,"id":404},{"recipe_id":5,"product_id":107,"id":405},{"recipe_id":6,"product_id":75,"id":406},{"recipe_id":7,"product_id":13,"id":407},{"recipe_id":8,"product_id":87,"id":408},{"recipe_id":9,"product_id":17,"id":409},{"recipe_id":10,"product_id":31,"id":410},{"recipe_id":11,"product_id":63,"id":411},{"recipe_id":12,"product_id":79,"id":412},{"recipe_id":13,"product_id":107,"id":413},{"recipe_id":14,"product_id":13,"id":414},{"recipe_id":15,"product_id":62,"id":415},{"recipe_id":16,"product_id":114,"id":416},{"recipe_id":17,"product_id":75,"id":417},{"recipe_id":18,"product_id":97,"id":418},{"recipe_id":19,"product_id":49,"id":419},{"recipe_id":20,"product_id":72,"id":420},{"recipe_id":21,"product_id":13,"id":421},{"recipe_id":22,"product_id":62,"id":422},{"recipe_id":23,"product_id":4,"id":423},{"recipe_id":24,"product_id":62,"id":424},{"recipe_id":25,"product_id":91,"id":425},{"recipe_id":26,"product_id":31,"id":426},{"recipe_id":27,"product_id":4,"id":427},{"recipe_id":28,"product_id":3,"id":428},{"recipe_id":29,"product_id":109,"id":429},{"recipe_id":30,"product_id":4,"id":430},{"recipe_id":31,"product_id":60,"id":431},{"recipe_id":32,"product_id":76,"id":432},{"recipe_id":33,"product_id":62,"id":433},{"recipe_id":34,"product_id":86,"id":434},{"recipe_id":36,"product_id":85,"id":436},{"recipe_id":37,"product_id":48,"id":437},{"recipe_id":38,"product_id":52,"id":438},{"recipe_id":39,"product_id":4,"id":439},{"recipe_id":40,"product_id":12,"id":440},{"recipe_id":41,"product_id":115,"id":441},{"recipe_id":42,"product_id":52,"id":442},{"recipe_id":43,"product_id":70,"id":443},{"recipe_id":44,"product_id":72,"id":444},{"recipe_id":45,"product_id":13,"id":445},{"recipe_id":46,"product_id":13,"id":446},{"recipe_id":47,"product_id":72,"id":447},{"recipe_id":48,"product_id":29,"id":448},{"recipe_id":49,"product_id":91,"id":449},{"recipe_id":50,"product_id":45,"id":450},{"recipe_id":51,"product_id":60,"id":451},{"recipe_id":52,"product_id":118,"id":452},{"recipe_id":53,"product_id":76,"id":453},{"recipe_id":54,"product_id":86,"id":454},{"recipe_id":55,"product_id":62,"id":455},{"recipe_id":56,"product_id":4,"id":456},{"recipe_id":57,"product_id":86,"id":457},{"recipe_id":58,"product_id":62,"id":458},{"recipe_id":59,"product_id":91,"id":459},{"recipe_id":60,"product_id":13,"id":460},{"recipe_id":61,"product_id":62,"id":461},{"recipe_id":62,"product_id":76,"id":462},{"recipe_id":65,"product_id":36,"id":465},{"recipe_id":66,"product_id":91,"id":466},{"recipe_id":67,"product_id":62,"id":467},{"recipe_id":68,"product_id":83,"id":468},{"recipe_id":69,"product_id":62,"id":469},{"recipe_id":70,"product_id":72,"id":470},{"recipe_id":71,"product_id":6,"id":471},{"recipe_id":72,"product_id":13,"id":472},{"recipe_id":73,"product_id":14,"id":473},{"recipe_id":74,"product_id":48,"id":474},{"recipe_id":75,"product_id":62,"id":475},{"recipe_id":76,"product_id":62,"id":476},{"recipe_id":78,"product_id":107,"id":478},{"recipe_id":79,"product_id":109,"id":479},{"recipe_id":80,"product_id":79,"id":480},{"recipe_id":81,"product_id":62,"id":481},{"recipe_id":82,"product_id":75,"id":482},{"recipe_id":83,"product_id":86,"id":483},{"recipe_id":84,"product_id":13,"id":484},{"recipe_id":85,"product_id":48,"id":485},{"recipe_id":86,"product_id":62,"id":486},{"recipe_id":87,"product_id":62,"id":487},{"recipe_id":88,"product_id":75,"id":488},{"recipe_id":89,"product_id":75,"id":489},{"recipe_id":90,"product_id":4,"id":490},{"recipe_id":91,"product_id":49,"id":491},{"recipe_id":92,"product_id":49,"id":492},{"recipe_id":93,"product_id":13,"id":493},{"recipe_id":94,"product_id":42,"id":494},{"recipe_id":95,"product_id":79,"id":495},{"recipe_id":96,"product_id":86,"id":496},{"recipe_id":97,"product_id":62,"id":497},{"recipe_id":98,"product_id":76,"id":498},{"recipe_id":99,"product_id":60,"id":499},{"recipe_id":0,"product_id":100,"id":500},{"recipe_id":1,"product_id":86,"id":501},{"recipe_id":2,"product_id":73,"id":502},{"recipe_id":3,"product_id":63,"id":503},{"recipe_id":4,"product_id":13,"id":504},{"recipe_id":5,"product_id":105,"id":505},{"recipe_id":6,"product_id":4,"id":506},{"recipe_id":7,"product_id":4,"id":507},{"recipe_id":8,"product_id":75,"id":508},{"recipe_id":9,"product_id":118,"id":509},{"recipe_id":10,"product_id":97,"id":510},{"recipe_id":11,"product_id":115,"id":511},{"recipe_id":12,"product_id":72,"id":512},{"recipe_id":13,"product_id":115,"id":513},{"recipe_id":14,"product_id":23,"id":514},{"recipe_id":15,"product_id":96,"id":515},{"recipe_id":16,"product_id":13,"id":516},{"recipe_id":17,"product_id":13,"id":517},{"recipe_id":18,"product_id":82,"id":518},{"recipe_id":19,"product_id":52,"id":519},{"recipe_id":20,"product_id":95,"id":520},{"recipe_id":21,"product_id":35,"id":521},{"recipe_id":22,"product_id":76,"id":522},{"recipe_id":23,"product_id":86,"id":523},{"recipe_id":24,"product_id":31,"id":524},{"recipe_id":25,"product_id":4,"id":525},{"recipe_id":26,"product_id":52,"id":526},{"recipe_id":27,"product_id":62,"id":527},{"recipe_id":28,"product_id":86,"id":528},{"recipe_id":29,"product_id":63,"id":529},{"recipe_id":30,"product_id":72,"id":530},{"recipe_id":31,"product_id":75,"id":531},{"recipe_id":32,"product_id":4,"id":532},{"recipe_id":33,"product_id":97,"id":533},{"recipe_id":34,"product_id":104,"id":534},{"recipe_id":36,"product_id":76,"id":536},{"recipe_id":37,"product_id":91,"id":537},{"recipe_id":38,"product_id":31,"id":538},{"recipe_id":39,"product_id":10,"id":539},{"recipe_id":40,"product_id":13,"id":540},{"recipe_id":41,"product_id":72,"id":541},{"recipe_id":42,"product_id":92,"id":542},{"recipe_id":43,"product_id":62,"id":543},{"recipe_id":44,"product_id":62,"id":544},{"recipe_id":45,"product_id":4,"id":545},{"recipe_id":46,"product_id":62,"id":546},{"recipe_id":48,"product_id":62,"id":548},{"recipe_id":49,"product_id":62,"id":549},{"recipe_id":50,"product_id":62,"id":550},{"recipe_id":52,"product_id":17,"id":552},{"recipe_id":53,"product_id":62,"id":553},{"recipe_id":54,"product_id":62,"id":554},{"recipe_id":55,"product_id":91,"id":555},{"recipe_id":56,"product_id":60,"id":556},{"recipe_id":57,"product_id":112,"id":557},{"recipe_id":58,"product_id":76,"id":558},{"recipe_id":59,"product_id":52,"id":559},{"recipe_id":60,"product_id":16,"id":560},{"recipe_id":61,"product_id":45,"id":561},{"recipe_id":62,"product_id":4,"id":562},{"recipe_id":66,"product_id":4,"id":566},{"recipe_id":67,"product_id":109,"id":567},{"recipe_id":68,"product_id":52,"id":568},{"recipe_id":69,"product_id":13,"id":569},{"recipe_id":70,"product_id":107,"id":570},{"recipe_id":71,"product_id":60,"id":571},{"recipe_id":72,"product_id":118,"id":572},{"recipe_id":73,"product_id":95,"id":573},{"recipe_id":74,"product_id":23,"id":574},{"recipe_id":75,"product_id":3,"id":575},{"recipe_id":78,"product_id":13,"id":578},{"recipe_id":79,"product_id":39,"id":579},{"recipe_id":80,"product_id":4,"id":580},{"recipe_id":81,"product_id":107,"id":581},{"recipe_id":82,"product_id":115,"id":582},{"recipe_id":83,"product_id":107,"id":583},{"recipe_id":84,"product_id":13,"id":584},{"recipe_id":85,"product_id":48,"id":585},{"recipe_id":86,"product_id":68,"id":586},{"recipe_id":87,"product_id":13,"id":587},{"recipe_id":90,"product_id":76,"id":590},{"recipe_id":91,"product_id":62,"id":591},{"recipe_id":92,"product_id":62,"id":592},{"recipe_id":93,"product_id":111,"id":593},{"recipe_id":94,"product_id":72,"id":594},{"recipe_id":95,"product_id":63,"id":595},{"recipe_id":96,"product_id":62,"id":596},{"recipe_id":97,"product_id":107,"id":597},{"recipe_id":98,"product_id":52,"id":598},{"recipe_id":99,"product_id":75,"id":599},{"recipe_id":0,"product_id":13,"id":600},{"recipe_id":1,"product_id":107,"id":601},{"recipe_id":2,"product_id":109,"id":602},{"recipe_id":3,"product_id":82,"id":603},{"recipe_id":4,"product_id":79,"id":604},{"recipe_id":5,"product_id":60,"id":605},{"recipe_id":6,"product_id":62,"id":606},{"recipe_id":7,"product_id":72,"id":607},{"recipe_id":8,"product_id":115,"id":608},{"recipe_id":9,"product_id":62,"id":609},{"recipe_id":10,"product_id":107,"id":610},{"recipe_id":11,"product_id":62,"id":611},{"recipe_id":12,"product_id":62,"id":612},{"recipe_id":13,"product_id":13,"id":613},{"recipe_id":14,"product_id":62,"id":614},{"recipe_id":15,"product_id":84,"id":615},{"recipe_id":17,"product_id":79,"id":617},{"recipe_id":18,"product_id":60,"id":618},{"recipe_id":19,"product_id":75,"id":619},{"recipe_id":20,"product_id":52,"id":620},{"recipe_id":21,"product_id":9,"id":621},{"recipe_id":22,"product_id":7,"id":622},{"recipe_id":23,"product_id":107,"id":623},{"recipe_id":24,"product_id":60,"id":624},{"recipe_id":25,"product_id":52,"id":625},{"recipe_id":27,"product_id":60,"id":627},{"recipe_id":28,"product_id":75,"id":628},{"recipe_id":29,"product_id":9,"id":629},{"recipe_id":30,"product_id":109,"id":630},{"recipe_id":31,"product_id":13,"id":631},{"recipe_id":32,"product_id":62,"id":632},{"recipe_id":33,"product_id":76,"id":633},{"recipe_id":34,"product_id":72,"id":634},{"recipe_id":36,"product_id":4,"id":636},{"recipe_id":37,"product_id":54,"id":637},{"recipe_id":38,"product_id":60,"id":638},{"recipe_id":39,"product_id":62,"id":639},{"recipe_id":40,"product_id":109,"id":640},{"recipe_id":41,"product_id":79,"id":641},{"recipe_id":42,"product_id":75,"id":642},{"recipe_id":43,"product_id":107,"id":643},{"recipe_id":44,"product_id":107,"id":644},{"recipe_id":45,"product_id":77,"id":645},{"recipe_id":46,"product_id":72,"id":646},{"recipe_id":48,"product_id":4,"id":648},{"recipe_id":49,"product_id":109,"id":649},{"recipe_id":50,"product_id":63,"id":650},{"recipe_id":52,"product_id":112,"id":652},{"recipe_id":53,"product_id":91,"id":653},{"recipe_id":54,"product_id":91,"id":654},{"recipe_id":55,"product_id":60,"id":655},{"recipe_id":57,"product_id":60,"id":657},{"recipe_id":58,"product_id":60,"id":658},{"recipe_id":59,"product_id":32,"id":659},{"recipe_id":60,"product_id":60,"id":660},{"recipe_id":61,"product_id":13,"id":661},{"recipe_id":62,"product_id":52,"id":662},{"recipe_id":66,"product_id":62,"id":666},{"recipe_id":67,"product_id":60,"id":667},{"recipe_id":68,"product_id":62,"id":668},{"recipe_id":69,"product_id":105,"id":669},{"recipe_id":70,"product_id":78,"id":670},{"recipe_id":71,"product_id":4,"id":671},{"recipe_id":72,"product_id":58,"id":672},{"recipe_id":73,"product_id":101,"id":673},{"recipe_id":74,"product_id":75,"id":674},{"recipe_id":75,"product_id":100,"id":675},{"recipe_id":78,"product_id":79,"id":678},{"recipe_id":79,"product_id":100,"id":679},{"recipe_id":80,"product_id":13,"id":680},{"recipe_id":81,"product_id":34,"id":681},{"recipe_id":82,"product_id":13,"id":682},{"recipe_id":83,"product_id":34,"id":683},{"recipe_id":84,"product_id":82,"id":684},{"recipe_id":85,"product_id":75,"id":685},{"recipe_id":86,"product_id":69,"id":686},{"recipe_id":87,"product_id":100,"id":687},{"recipe_id":90,"product_id":109,"id":690},{"recipe_id":91,"product_id":45,"id":691},{"recipe_id":92,"product_id":60,"id":692},{"recipe_id":93,"product_id":13,"id":693},{"recipe_id":94,"product_id":78,"id":694},{"recipe_id":95,"product_id":62,"id":695},{"recipe_id":96,"product_id":91,"id":696},{"recipe_id":97,"product_id":109,"id":697},{"recipe_id":98,"product_id":107,"id":698},{"recipe_id":99,"product_id":86,"id":699},{"recipe_id":0,"product_id":100,"id":700},{"recipe_id":1,"product_id":52,"id":701},{"recipe_id":2,"product_id":72,"id":702},{"recipe_id":3,"product_id":97,"id":703},{"recipe_id":4,"product_id":72,"id":704},{"recipe_id":5,"product_id":13,"id":705},{"recipe_id":6,"product_id":91,"id":706},{"recipe_id":7,"product_id":62,"id":707},{"recipe_id":8,"product_id":13,"id":708},{"recipe_id":9,"product_id":72,"id":709},{"recipe_id":10,"product_id":52,"id":710},{"recipe_id":12,"product_id":4,"id":712},{"recipe_id":13,"product_id":56,"id":713},{"recipe_id":14,"product_id":60,"id":714},{"recipe_id":15,"product_id":17,"id":715},{"recipe_id":17,"product_id":72,"id":717},{"recipe_id":19,"product_id":62,"id":719},{"recipe_id":20,"product_id":49,"id":720},{"recipe_id":21,"product_id":86,"id":721},{"recipe_id":22,"product_id":82,"id":722},{"recipe_id":23,"product_id":59,"id":723},{"recipe_id":24,"product_id":75,"id":724},{"recipe_id":25,"product_id":62,"id":725},{"recipe_id":28,"product_id":49,"id":728},{"recipe_id":29,"product_id":1,"id":729},{"recipe_id":30,"product_id":62,"id":730},{"recipe_id":31,"product_id":114,"id":731},{"recipe_id":32,"product_id":13,"id":732},{"recipe_id":33,"product_id":60,"id":733},{"recipe_id":34,"product_id":62,"id":734},{"recipe_id":36,"product_id":62,"id":736},{"recipe_id":37,"product_id":17,"id":737},{"recipe_id":39,"product_id":75,"id":739},{"recipe_id":40,"product_id":63,"id":740},{"recipe_id":41,"product_id":115,"id":741},{"recipe_id":42,"product_id":76,"id":742},{"recipe_id":43,"product_id":52,"id":743},{"recipe_id":44,"product_id":84,"id":744},{"recipe_id":45,"product_id":105,"id":745},{"recipe_id":46,"product_id":109,"id":746},{"recipe_id":48,"product_id":48,"id":748},{"recipe_id":50,"product_id":50,"id":750},{"recipe_id":52,"product_id":66,"id":752},{"recipe_id":53,"product_id":13,"id":753},{"recipe_id":54,"product_id":13,"id":754},{"recipe_id":57,"product_id":41,"id":757},{"recipe_id":58,"product_id":118,"id":758},{"recipe_id":59,"product_id":60,"id":759},{"recipe_id":61,"product_id":60,"id":761},{"recipe_id":62,"product_id":52,"id":762},{"recipe_id":66,"product_id":60,"id":766},{"recipe_id":67,"product_id":73,"id":767},{"recipe_id":68,"product_id":4,"id":768},{"recipe_id":69,"product_id":98,"id":769},{"recipe_id":70,"product_id":100,"id":770},{"recipe_id":71,"product_id":75,"id":771},{"recipe_id":72,"product_id":76,"id":772},{"recipe_id":73,"product_id":47,"id":773},{"recipe_id":75,"product_id":13,"id":775},{"recipe_id":78,"product_id":62,"id":778},{"recipe_id":80,"product_id":30,"id":780},{"recipe_id":81,"product_id":4,"id":781},{"recipe_id":82,"product_id":52,"id":782},{"recipe_id":84,"product_id":56,"id":784},{"recipe_id":85,"product_id":23,"id":785},{"recipe_id":86,"product_id":76,"id":786},{"recipe_id":90,"product_id":63,"id":790},{"recipe_id":91,"product_id":91,"id":791},{"recipe_id":93,"product_id":79,"id":793},{"recipe_id":94,"product_id":71,"id":794},{"recipe_id":95,"product_id":84,"id":795},{"recipe_id":97,"product_id":63,"id":797},{"recipe_id":98,"product_id":107,"id":798},{"recipe_id":1,"product_id":4,"id":801},{"recipe_id":2,"product_id":79,"id":802},{"recipe_id":3,"product_id":59,"id":803},{"recipe_id":4,"product_id":62,"id":804},{"recipe_id":5,"product_id":20,"id":805},{"recipe_id":6,"product_id":45,"id":806},{"recipe_id":7,"product_id":60,"id":807},{"recipe_id":8,"product_id":62,"id":808},{"recipe_id":9,"product_id":4,"id":809},{"recipe_id":10,"product_id":40,"id":810},{"recipe_id":12,"product_id":31,"id":812},{"recipe_id":13,"product_id":72,"id":813},{"recipe_id":14,"product_id":56,"id":814},{"recipe_id":17,"product_id":62,"id":817},{"recipe_id":19,"product_id":100,"id":819},{"recipe_id":20,"product_id":4,"id":820},{"recipe_id":21,"product_id":4,"id":821},{"recipe_id":22,"product_id":56,"id":822},{"recipe_id":23,"product_id":39,"id":823},{"recipe_id":24,"product_id":78,"id":824},{"recipe_id":25,"product_id":91,"id":825},{"recipe_id":29,"product_id":13,"id":829},{"recipe_id":30,"product_id":63,"id":830},{"recipe_id":31,"product_id":101,"id":831},{"recipe_id":32,"product_id":45,"id":832},{"recipe_id":34,"product_id":63,"id":834},{"recipe_id":36,"product_id":32,"id":836},{"recipe_id":37,"product_id":81,"id":837},{"recipe_id":39,"product_id":35,"id":839},{"recipe_id":40,"product_id":79,"id":840},{"recipe_id":41,"product_id":13,"id":841},{"recipe_id":42,"product_id":17,"id":842},{"recipe_id":43,"product_id":60,"id":843},{"recipe_id":44,"product_id":86,"id":844},{"recipe_id":45,"product_id":105,"id":845},{"recipe_id":46,"product_id":88,"id":846},{"recipe_id":50,"product_id":20,"id":850},{"recipe_id":52,"product_id":102,"id":852},{"recipe_id":53,"product_id":109,"id":853},{"recipe_id":54,"product_id":60,"id":854},{"recipe_id":58,"product_id":17,"id":858},{"recipe_id":59,"product_id":73,"id":859},{"recipe_id":66,"product_id":27,"id":866},{"recipe_id":68,"product_id":76,"id":868},{"recipe_id":69,"product_id":75,"id":869},{"recipe_id":71,"product_id":13,"id":871},{"recipe_id":72,"product_id":23,"id":872},{"recipe_id":73,"product_id":109,"id":873},{"recipe_id":75,"product_id":91,"id":875},{"recipe_id":78,"product_id":109,"id":878},{"recipe_id":80,"product_id":109,"id":880},{"recipe_id":81,"product_id":29,"id":881},{"recipe_id":82,"product_id":4,"id":882},{"recipe_id":84,"product_id":32,"id":884},{"recipe_id":86,"product_id":60,"id":886},{"recipe_id":90,"product_id":0,"id":890},{"recipe_id":91,"product_id":19,"id":891},{"recipe_id":93,"product_id":15,"id":893},{"recipe_id":94,"product_id":60,"id":894},{"recipe_id":95,"product_id":86,"id":895},{"recipe_id":97,"product_id":73,"id":897},{"recipe_id":98,"product_id":61,"id":898},{"recipe_id":1,"product_id":115,"id":901},{"recipe_id":2,"product_id":95,"id":902},{"recipe_id":3,"product_id":39,"id":903},{"recipe_id":8,"product_id":79,"id":908},{"recipe_id":9,"product_id":51,"id":909},{"recipe_id":13,"product_id":109,"id":913},{"recipe_id":14,"product_id":82,"id":914},{"recipe_id":17,"product_id":109,"id":917},{"recipe_id":19,"product_id":60,"id":919},{"recipe_id":20,"product_id":100,"id":920},{"recipe_id":21,"product_id":107,"id":921},{"recipe_id":22,"product_id":87,"id":922},{"recipe_id":23,"product_id":115,"id":923},{"recipe_id":24,"product_id":100,"id":924},{"recipe_id":25,"product_id":20,"id":925},{"recipe_id":29,"product_id":62,"id":929},{"recipe_id":30,"product_id":21,"id":930},{"recipe_id":31,"product_id":43,"id":931},{"recipe_id":32,"product_id":91,"id":932},{"recipe_id":34,"product_id":109,"id":934},{"recipe_id":36,"product_id":17,"id":936},{"recipe_id":37,"product_id":118,"id":937},{"recipe_id":39,"product_id":86,"id":939},{"recipe_id":40,"product_id":62,"id":940},{"recipe_id":41,"product_id":109,"id":941},{"recipe_id":42,"product_id":118,"id":942},{"recipe_id":43,"product_id":107,"id":943},{"recipe_id":44,"product_id":105,"id":944},{"recipe_id":45,"product_id":79,"id":945},{"recipe_id":46,"product_id":63,"id":946},{"recipe_id":50,"product_id":49,"id":950},{"recipe_id":52,"product_id":5,"id":952},{"recipe_id":53,"product_id":63,"id":953},{"recipe_id":58,"product_id":18,"id":958},{"recipe_id":68,"product_id":75,"id":968},{"recipe_id":69,"product_id":60,"id":969},{"recipe_id":71,"product_id":46,"id":971},{"recipe_id":72,"product_id":48,"id":972},{"recipe_id":73,"product_id":4,"id":973},{"recipe_id":78,"product_id":82,"id":978},{"recipe_id":80,"product_id":57,"id":980},{"recipe_id":81,"product_id":116,"id":981},{"recipe_id":82,"product_id":79,"id":982},{"recipe_id":84,"product_id":91,"id":984},{"recipe_id":90,"product_id":91,"id":990},{"recipe_id":91,"product_id":60,"id":991},{"recipe_id":93,"product_id":62,"id":993},{"recipe_id":95,"product_id":49,"id":995},{"recipe_id":97,"product_id":4,"id":997},{"recipe_id":98,"product_id":107,"id":998},{"recipe_id":1,"product_id":46,"id":1001},{"recipe_id":3,"product_id":73,"id":1003},{"recipe_id":8,"product_id":72,"id":1008},{"recipe_id":9,"product_id":22,"id":1009},{"recipe_id":13,"product_id":116,"id":1013},{"recipe_id":17,"product_id":88,"id":1017},{"recipe_id":20,"product_id":100,"id":1020},{"recipe_id":21,"product_id":39,"id":1021},{"recipe_id":22,"product_id":32,"id":1022},{"recipe_id":29,"product_id":72,"id":1029},{"recipe_id":30,"product_id":100,"id":1030},{"recipe_id":31,"product_id":73,"id":1031},{"recipe_id":32,"product_id":60,"id":1032},{"recipe_id":34,"product_id":104,"id":1034},{"recipe_id":36,"product_id":56,"id":1036},{"recipe_id":37,"product_id":62,"id":1037},{"recipe_id":41,"product_id":33,"id":1041},{"recipe_id":42,"product_id":62,"id":1042},{"recipe_id":43,"product_id":92,"id":1043},{"recipe_id":44,"product_id":98,"id":1044},{"recipe_id":45,"product_id":72,"id":1045},{"recipe_id":46,"product_id":39,"id":1046},{"recipe_id":50,"product_id":13,"id":1050},{"recipe_id":52,"product_id":91,"id":1052},{"recipe_id":53,"product_id":30,"id":1053},{"recipe_id":69,"product_id":107,"id":1069},{"recipe_id":71,"product_id":52,"id":1071},{"recipe_id":72,"product_id":61,"id":1072},{"recipe_id":78,"product_id":18,"id":1078},{"recipe_id":82,"product_id":62,"id":1082},{"recipe_id":90,"product_id":60,"id":1090},{"recipe_id":93,"product_id":109,"id":1093},{"recipe_id":95,"product_id":107,"id":1095},{"recipe_id":97,"product_id":99,"id":1097},{"recipe_id":98,"product_id":46,"id":1098},{"recipe_id":1,"product_id":11,"id":1101},{"recipe_id":3,"product_id":107,"id":1103},{"recipe_id":8,"product_id":116,"id":1108},{"recipe_id":9,"product_id":86,"id":1109},{"recipe_id":13,"product_id":70,"id":1113},{"recipe_id":17,"product_id":33,"id":1117},{"recipe_id":21,"product_id":73,"id":1121},{"recipe_id":22,"product_id":106,"id":1122},{"recipe_id":29,"product_id":79,"id":1129},{"recipe_id":30,"product_id":107,"id":1130},{"recipe_id":31,"product_id":107,"id":1131},{"recipe_id":34,"product_id":39,"id":1134},{"recipe_id":36,"product_id":60,"id":1136},{"recipe_id":37,"product_id":60,"id":1137},{"recipe_id":41,"product_id":59,"id":1141},{"recipe_id":42,"product_id":5,"id":1142},{"recipe_id":43,"product_id":39,"id":1143},{"recipe_id":44,"product_id":4,"id":1144},{"recipe_id":45,"product_id":62,"id":1145},{"recipe_id":50,"product_id":31,"id":1150},{"recipe_id":52,"product_id":60,"id":1152},{"recipe_id":53,"product_id":2,"id":1153},{"recipe_id":69,"product_id":63,"id":1169},{"recipe_id":71,"product_id":46,"id":1171},{"recipe_id":82,"product_id":109,"id":1182},{"recipe_id":90,"product_id":73,"id":1190},{"recipe_id":93,"product_id":97,"id":1193},{"recipe_id":95,"product_id":64,"id":1195},{"recipe_id":97,"product_id":75,"id":1197},{"recipe_id":1,"product_id":100,"id":1201},{"recipe_id":3,"product_id":52,"id":1203},{"recipe_id":9,"product_id":74,"id":1209},{"recipe_id":22,"product_id":60,"id":1222},{"recipe_id":30,"product_id":75,"id":1230},{"recipe_id":41,"product_id":73,"id":1241},{"recipe_id":42,"product_id":76,"id":1242},{"recipe_id":43,"product_id":75,"id":1243},{"recipe_id":45,"product_id":70,"id":1245},{"recipe_id":50,"product_id":107,"id":1250},{"recipe_id":53,"product_id":67,"id":1253},{"recipe_id":71,"product_id":105,"id":1271},{"recipe_id":82,"product_id":4,"id":1282},{"recipe_id":90,"product_id":70,"id":1290},{"recipe_id":97,"product_id":100,"id":1297},{"recipe_id":1,"product_id":46,"id":1301},{"recipe_id":3,"product_id":86,"id":1303},{"recipe_id":45,"product_id":98,"id":1345},{"recipe_id":50,"product_id":52,"id":1350},{"recipe_id":53,"product_id":114,"id":1353},{"recipe_id":71,"product_id":62,"id":1371},{"recipe_id":90,"product_id":75,"id":1390},{"recipe_id":97,"product_id":98,"id":1397},{"recipe_id":1,"product_id":115,"id":1401},{"recipe_id":53,"product_id":60,"id":1453},{"recipe_id":71,"product_id":107,"id":1471},{"recipe_id":97,"product_id":105,"id":1497},{"recipe_id":1,"product_id":70,"id":1501},{"recipe_id":53,"product_id":73,"id":1553},{"recipe_id":71,"product_id":100,"id":1571},{"recipe_id":53,"product_id":20,"id":1653},{"recipe_id":71,"product_id":100,"id":1671},{"recipe_id":71,"product_id":70,"id":1771}]}}